hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rif.h
/*
; stm32N657_rif.
; ==============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_rif equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// RIF address definitions
// -----------------------

typedef struct {
	volatile	uint32_t	IER0;
	volatile	uint32_t	IER1;
	volatile	uint32_t	IER2;
	volatile	uint32_t	IER3;
	volatile	uint32_t	IER4;
	volatile	uint32_t	IER5;
	volatile	uint32_t	RESERVED0[26];
	volatile	uint32_t	ISR0;
	volatile	uint32_t	ISR1;
	volatile	uint32_t	ISR2;
	volatile	uint32_t	ISR3;
	volatile	uint32_t	ISR4;
	volatile	uint32_t	ISR5;
	volatile	uint32_t	RESERVED1[26];
	volatile	uint32_t	ICR0;
	volatile	uint32_t	ICR1;
	volatile	uint32_t	ICR2;
	volatile	uint32_t	ICR3;
	volatile	uint32_t	ICR4;
	volatile	uint32_t	ICR5;
	volatile	uint32_t	RESERVED2[149];
	volatile	uint32_t	IISR0;
	volatile	uint32_t	IISR1;
	volatile	uint32_t	IISR2;
	volatile	uint32_t	IISR3;
	volatile	uint32_t	IISR4;
	volatile	uint32_t	RESERVED3;
	volatile	uint32_t	IISR5;
} RIF_TypeDef;

#if (defined(__cplusplus))
#define	IAC_NS	reinterpret_cast<RIF_TypeDef *>(0x44025000u)
#define	IAC_S	reinterpret_cast<RIF_TypeDef *>(0x54025000u)

#else
#define	IAC_NS	((RIF_TypeDef *)0x44025000u)
#define	IAC_S	((RIF_TypeDef *)0x54025000u)
#endif

// IER0 Configuration

#define	RIF_IER0_IAIE31				(0x1u<<31)
#define	RIF_IER0_IAIE30				(0x1u<<30)
#define	RIF_IER0_IAIE29				(0x1u<<29)
#define	RIF_IER0_IAIE28				(0x1u<<28)
#define	RIF_IER0_IAIE27				(0x1u<<27)
#define	RIF_IER0_IAIE26				(0x1u<<26)
#define	RIF_IER0_IAIE25				(0x1u<<25)
#define	RIF_IER0_IAIE24				(0x1u<<24)
#define	RIF_IER0_IAIE23				(0x1u<<23)
#define	RIF_IER0_IAIE22				(0x1u<<22)
#define	RIF_IER0_IAIE21				(0x1u<<21)
#define	RIF_IER0_IAIE20				(0x1u<<20)
#define	RIF_IER0_IAIE19				(0x1u<<19)
#define	RIF_IER0_IAIE18				(0x1u<<18)
#define	RIF_IER0_IAIE17				(0x1u<<17)
#define	RIF_IER0_IAIE16				(0x1u<<16)
#define	RIF_IER0_IAIE15				(0x1u<<15)
#define	RIF_IER0_IAIE14				(0x1u<<14)
#define	RIF_IER0_IAIE13				(0x1u<<13)
#define	RIF_IER0_IAIE12				(0x1u<<12)
#define	RIF_IER0_IAIE11				(0x1u<<11)
#define	RIF_IER0_IAIE10				(0x1u<<10)
#define	RIF_IER0_IAIE9				(0x1u<<9)
#define	RIF_IER0_IAIE8				(0x1u<<8)
#define	RIF_IER0_IAIE7				(0x1u<<7)
#define	RIF_IER0_IAIE6				(0x1u<<6)
#define	RIF_IER0_IAIE5				(0x1u<<5)
#define	RIF_IER0_IAIE4				(0x1u<<4)
#define	RIF_IER0_IAIE3				(0x1u<<3)
#define	RIF_IER0_IAIE2				(0x1u<<2)
#define	RIF_IER0_IAIE1				(0x1u<<1)
#define	RIF_IER0_IAIE0				(0x1u<<0)

#define	RIF_IER0_IAIE31_B_0X0		(0x0u<<31)
#define	RIF_IER0_IAIE31_B_0X1		(0x1u<<31)
#define	RIF_IER0_IAIE30_B_0X0		(0x0u<<30)
#define	RIF_IER0_IAIE30_B_0X1		(0x1u<<30)
#define	RIF_IER0_IAIE29_B_0X0		(0x0u<<29)
#define	RIF_IER0_IAIE29_B_0X1		(0x1u<<29)
#define	RIF_IER0_IAIE28_B_0X0		(0x0u<<28)
#define	RIF_IER0_IAIE28_B_0X1		(0x1u<<28)
#define	RIF_IER0_IAIE27_B_0X0		(0x0u<<27)
#define	RIF_IER0_IAIE27_B_0X1		(0x1u<<27)
#define	RIF_IER0_IAIE26_B_0X0		(0x0u<<26)
#define	RIF_IER0_IAIE26_B_0X1		(0x1u<<26)
#define	RIF_IER0_IAIE25_B_0X0		(0x0u<<25)
#define	RIF_IER0_IAIE25_B_0X1		(0x1u<<25)
#define	RIF_IER0_IAIE24_B_0X0		(0x0u<<24)
#define	RIF_IER0_IAIE24_B_0X1		(0x1u<<24)
#define	RIF_IER0_IAIE23_B_0X0		(0x0u<<23)
#define	RIF_IER0_IAIE23_B_0X1		(0x1u<<23)
#define	RIF_IER0_IAIE22_B_0X0		(0x0u<<22)
#define	RIF_IER0_IAIE22_B_0X1		(0x1u<<22)
#define	RIF_IER0_IAIE21_B_0X0		(0x0u<<21)
#define	RIF_IER0_IAIE21_B_0X1		(0x1u<<21)
#define	RIF_IER0_IAIE20_B_0X0		(0x0u<<20)
#define	RIF_IER0_IAIE20_B_0X1		(0x1u<<20)
#define	RIF_IER0_IAIE19_B_0X0		(0x0u<<19)
#define	RIF_IER0_IAIE19_B_0X1		(0x1u<<19)
#define	RIF_IER0_IAIE18_B_0X0		(0x0u<<18)
#define	RIF_IER0_IAIE18_B_0X1		(0x1u<<18)
#define	RIF_IER0_IAIE17_B_0X0		(0x0u<<17)
#define	RIF_IER0_IAIE17_B_0X1		(0x1u<<17)
#define	RIF_IER0_IAIE16_B_0X0		(0x0u<<16)
#define	RIF_IER0_IAIE16_B_0X1		(0x1u<<16)
#define	RIF_IER0_IAIE15_B_0X0		(0x0u<<15)
#define	RIF_IER0_IAIE15_B_0X1		(0x1u<<15)
#define	RIF_IER0_IAIE14_B_0X0		(0x0u<<14)
#define	RIF_IER0_IAIE14_B_0X1		(0x1u<<14)
#define	RIF_IER0_IAIE13_B_0X0		(0x0u<<13)
#define	RIF_IER0_IAIE13_B_0X1		(0x1u<<13)
#define	RIF_IER0_IAIE12_B_0X0		(0x0u<<12)
#define	RIF_IER0_IAIE12_B_0X1		(0x1u<<12)
#define	RIF_IER0_IAIE11_B_0X0		(0x0u<<11)
#define	RIF_IER0_IAIE11_B_0X1		(0x1u<<11)
#define	RIF_IER0_IAIE10_B_0X0		(0x0u<<10)
#define	RIF_IER0_IAIE10_B_0X1		(0x1u<<10)
#define	RIF_IER0_IAIE9_B_0X0		(0x0u<<9)
#define	RIF_IER0_IAIE9_B_0X1		(0x1u<<9)
#define	RIF_IER0_IAIE8_B_0X0		(0x0u<<8)
#define	RIF_IER0_IAIE8_B_0X1		(0x1u<<8)
#define	RIF_IER0_IAIE7_B_0X0		(0x0u<<7)
#define	RIF_IER0_IAIE7_B_0X1		(0x1u<<7)
#define	RIF_IER0_IAIE6_B_0X0		(0x0u<<6)
#define	RIF_IER0_IAIE6_B_0X1		(0x1u<<6)
#define	RIF_IER0_IAIE5_B_0X0		(0x0u<<5)
#define	RIF_IER0_IAIE5_B_0X1		(0x1u<<5)
#define	RIF_IER0_IAIE4_B_0X0		(0x0u<<4)
#define	RIF_IER0_IAIE4_B_0X1		(0x1u<<4)
#define	RIF_IER0_IAIE3_B_0X0		(0x0u<<3)
#define	RIF_IER0_IAIE3_B_0X1		(0x1u<<3)
#define	RIF_IER0_IAIE2_B_0X0		(0x0u<<2)
#define	RIF_IER0_IAIE2_B_0X1		(0x1u<<2)
#define	RIF_IER0_IAIE1_B_0X0		(0x0u<<1)
#define	RIF_IER0_IAIE1_B_0X1		(0x1u<<1)
#define	RIF_IER0_IAIE0_B_0X0		(0x0u<<0)
#define	RIF_IER0_IAIE0_B_0X1		(0x1u<<0)

