hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rif.h
// IER1 Configuration

#define	RIF_IER1_IAIE63				(0x1u<<31)
#define	RIF_IER1_IAIE62				(0x1u<<30)
#define	RIF_IER1_IAIE61				(0x1u<<29)
#define	RIF_IER1_IAIE60				(0x1u<<28)
#define	RIF_IER1_IAIE59				(0x1u<<27)
#define	RIF_IER1_IAIE58				(0x1u<<26)
#define	RIF_IER1_IAIE57				(0x1u<<25)
#define	RIF_IER1_IAIE56				(0x1u<<24)
#define	RIF_IER1_IAIE55				(0x1u<<23)
#define	RIF_IER1_IAIE54				(0x1u<<22)
#define	RIF_IER1_IAIE53				(0x1u<<21)
#define	RIF_IER1_IAIE52				(0x1u<<20)
#define	RIF_IER1_IAIE51				(0x1u<<19)
#define	RIF_IER1_IAIE50				(0x1u<<18)
#define	RIF_IER1_IAIE49				(0x1u<<17)
#define	RIF_IER1_IAIE48				(0x1u<<16)
#define	RIF_IER1_IAIE47				(0x1u<<15)
#define	RIF_IER1_IAIE46				(0x1u<<14)
#define	RIF_IER1_IAIE45				(0x1u<<13)
#define	RIF_IER1_IAIE44				(0x1u<<12)
#define	RIF_IER1_IAIE43				(0x1u<<11)
#define	RIF_IER1_IAIE42				(0x1u<<10)
#define	RIF_IER1_IAIE41				(0x1u<<9)
#define	RIF_IER1_IAIE40				(0x1u<<8)
#define	RIF_IER1_IAIE39				(0x1u<<7)
#define	RIF_IER1_IAIE38				(0x1u<<6)
#define	RIF_IER1_IAIE37				(0x1u<<5)
#define	RIF_IER1_IAIE36				(0x1u<<4)
#define	RIF_IER1_IAIE35				(0x1u<<3)
#define	RIF_IER1_IAIE34				(0x1u<<2)
#define	RIF_IER1_IAIE33				(0x1u<<1)
#define	RIF_IER1_IAIE32				(0x1u<<0)

#define	RIF_IER1_IAIE63_B_0X0		(0x0u<<31)
#define	RIF_IER1_IAIE63_B_0X1		(0x1u<<31)
#define	RIF_IER1_IAIE62_B_0X0		(0x0u<<30)
#define	RIF_IER1_IAIE62_B_0X1		(0x1u<<30)
#define	RIF_IER1_IAIE61_B_0X0		(0x0u<<29)
#define	RIF_IER1_IAIE61_B_0X1		(0x1u<<29)
#define	RIF_IER1_IAIE60_B_0X0		(0x0u<<28)
#define	RIF_IER1_IAIE60_B_0X1		(0x1u<<28)
#define	RIF_IER1_IAIE59_B_0X0		(0x0u<<27)
#define	RIF_IER1_IAIE59_B_0X1		(0x1u<<27)
#define	RIF_IER1_IAIE58_B_0X0		(0x0u<<26)
#define	RIF_IER1_IAIE58_B_0X1		(0x1u<<26)
#define	RIF_IER1_IAIE57_B_0X0		(0x0u<<25)
#define	RIF_IER1_IAIE57_B_0X1		(0x1u<<25)
#define	RIF_IER1_IAIE56_B_0X0		(0x0u<<24)
#define	RIF_IER1_IAIE56_B_0X1		(0x1u<<24)
#define	RIF_IER1_IAIE55_B_0X0		(0x0u<<23)
#define	RIF_IER1_IAIE55_B_0X1		(0x1u<<23)
#define	RIF_IER1_IAIE54_B_0X0		(0x0u<<22)
#define	RIF_IER1_IAIE54_B_0X1		(0x1u<<22)
#define	RIF_IER1_IAIE53_B_0X0		(0x0u<<21)
#define	RIF_IER1_IAIE53_B_0X1		(0x1u<<21)
#define	RIF_IER1_IAIE52_B_0X0		(0x0u<<20)
#define	RIF_IER1_IAIE52_B_0X1		(0x1u<<20)
#define	RIF_IER1_IAIE51_B_0X0		(0x0u<<19)
#define	RIF_IER1_IAIE51_B_0X1		(0x1u<<19)
#define	RIF_IER1_IAIE50_B_0X0		(0x0u<<18)
#define	RIF_IER1_IAIE50_B_0X1		(0x1u<<18)
#define	RIF_IER1_IAIE49_B_0X0		(0x0u<<17)
#define	RIF_IER1_IAIE49_B_0X1		(0x1u<<17)
#define	RIF_IER1_IAIE48_B_0X0		(0x0u<<16)
#define	RIF_IER1_IAIE48_B_0X1		(0x1u<<16)
#define	RIF_IER1_IAIE47_B_0X0		(0x0u<<15)
#define	RIF_IER1_IAIE47_B_0X1		(0x1u<<15)
#define	RIF_IER1_IAIE46_B_0X0		(0x0u<<14)
#define	RIF_IER1_IAIE46_B_0X1		(0x1u<<14)
#define	RIF_IER1_IAIE45_B_0X0		(0x0u<<13)
#define	RIF_IER1_IAIE45_B_0X1		(0x1u<<13)
#define	RIF_IER1_IAIE44_B_0X0		(0x0u<<12)
#define	RIF_IER1_IAIE44_B_0X1		(0x1u<<12)
#define	RIF_IER1_IAIE43_B_0X0		(0x0u<<11)
#define	RIF_IER1_IAIE43_B_0X1		(0x1u<<11)
#define	RIF_IER1_IAIE42_B_0X0		(0x0u<<10)
#define	RIF_IER1_IAIE42_B_0X1		(0x1u<<10)
#define	RIF_IER1_IAIE41_B_0X0		(0x0u<<9)
#define	RIF_IER1_IAIE41_B_0X1		(0x1u<<9)
#define	RIF_IER1_IAIE40_B_0X0		(0x0u<<8)
#define	RIF_IER1_IAIE40_B_0X1		(0x1u<<8)
#define	RIF_IER1_IAIE39_B_0X0		(0x0u<<7)
#define	RIF_IER1_IAIE39_B_0X1		(0x1u<<7)
#define	RIF_IER1_IAIE38_B_0X0		(0x0u<<6)
#define	RIF_IER1_IAIE38_B_0X1		(0x1u<<6)
#define	RIF_IER1_IAIE37_B_0X0		(0x0u<<5)
#define	RIF_IER1_IAIE37_B_0X1		(0x1u<<5)
#define	RIF_IER1_IAIE36_B_0X0		(0x0u<<4)
#define	RIF_IER1_IAIE36_B_0X1		(0x1u<<4)
#define	RIF_IER1_IAIE35_B_0X0		(0x0u<<3)
#define	RIF_IER1_IAIE35_B_0X1		(0x1u<<3)
#define	RIF_IER1_IAIE34_B_0X0		(0x0u<<2)
#define	RIF_IER1_IAIE34_B_0X1		(0x1u<<2)
#define	RIF_IER1_IAIE33_B_0X0		(0x0u<<1)
#define	RIF_IER1_IAIE33_B_0X1		(0x1u<<1)
#define	RIF_IER1_IAIE32_B_0X0		(0x0u<<0)
#define	RIF_IER1_IAIE32_B_0X1		(0x1u<<0)

// IER2 Configuration

#define	RIF_IER2_IAIE95				(0x1u<<31)
#define	RIF_IER2_IAIE94				(0x1u<<30)
#define	RIF_IER2_IAIE93				(0x1u<<29)
#define	RIF_IER2_IAIE92				(0x1u<<28)
#define	RIF_IER2_IAIE91				(0x1u<<27)
#define	RIF_IER2_IAIE90				(0x1u<<26)
#define	RIF_IER2_IAIE89				(0x1u<<25)
#define	RIF_IER2_IAIE88				(0x1u<<24)
#define	RIF_IER2_IAIE87				(0x1u<<23)
#define	RIF_IER2_IAIE86				(0x1u<<22)
#define	RIF_IER2_IAIE85				(0x1u<<21)
#define	RIF_IER2_IAIE84				(0x1u<<20)
#define	RIF_IER2_IAIE83				(0x1u<<19)
#define	RIF_IER2_IAIE82				(0x1u<<18)
#define	RIF_IER2_IAIE81				(0x1u<<17)
#define	RIF_IER2_IAIE80				(0x1u<<16)
#define	RIF_IER2_IAIE79				(0x1u<<15)
#define	RIF_IER2_IAIE78				(0x1u<<14)
#define	RIF_IER2_IAIE77				(0x1u<<13)
#define	RIF_IER2_IAIE76				(0x1u<<12)
#define	RIF_IER2_IAIE75				(0x1u<<11)
#define	RIF_IER2_IAIE74				(0x1u<<10)
#define	RIF_IER2_IAIE73				(0x1u<<9)
#define	RIF_IER2_IAIE72				(0x1u<<8)
#define	RIF_IER2_IAIE71				(0x1u<<7)
#define	RIF_IER2_IAIE70				(0x1u<<6)
#define	RIF_IER2_IAIE69				(0x1u<<5)
#define	RIF_IER2_IAIE68				(0x1u<<4)
#define	RIF_IER2_IAIE67				(0x1u<<3)
#define	RIF_IER2_IAIE66				(0x1u<<2)
#define	RIF_IER2_IAIE65				(0x1u<<1)
#define	RIF_IER2_IAIE64				(0x1u<<0)

#define	RIF_IER2_IAIE95_B_0X0		(0x0u<<31)
#define	RIF_IER2_IAIE95_B_0X1		(0x1u<<31)
#define	RIF_IER2_IAIE94_B_0X0		(0x0u<<30)
#define	RIF_IER2_IAIE94_B_0X1		(0x1u<<30)
#define	RIF_IER2_IAIE93_B_0X0		(0x0u<<29)
#define	RIF_IER2_IAIE93_B_0X1		(0x1u<<29)
#define	RIF_IER2_IAIE92_B_0X0		(0x0u<<28)
#define	RIF_IER2_IAIE92_B_0X1		(0x1u<<28)
#define	RIF_IER2_IAIE91_B_0X0		(0x0u<<27)
#define	RIF_IER2_IAIE91_B_0X1		(0x1u<<27)
#define	RIF_IER2_IAIE90_B_0X0		(0x0u<<26)
#define	RIF_IER2_IAIE90_B_0X1		(0x1u<<26)
#define	RIF_IER2_IAIE89_B_0X0		(0x0u<<25)
#define	RIF_IER2_IAIE89_B_0X1		(0x1u<<25)
#define	RIF_IER2_IAIE88_B_0X0		(0x0u<<24)
#define	RIF_IER2_IAIE88_B_0X1		(0x1u<<24)
#define	RIF_IER2_IAIE87_B_0X0		(0x0u<<23)
#define	RIF_IER2_IAIE87_B_0X1		(0x1u<<23)
#define	RIF_IER2_IAIE86_B_0X0		(0x0u<<22)
#define	RIF_IER2_IAIE86_B_0X1		(0x1u<<22)
#define	RIF_IER2_IAIE85_B_0X0		(0x0u<<21)
#define	RIF_IER2_IAIE85_B_0X1		(0x1u<<21)
#define	RIF_IER2_IAIE84_B_0X0		(0x0u<<20)
#define	RIF_IER2_IAIE84_B_0X1		(0x1u<<20)
#define	RIF_IER2_IAIE83_B_0X0		(0x0u<<19)
#define	RIF_IER2_IAIE83_B_0X1		(0x1u<<19)
#define	RIF_IER2_IAIE82_B_0X0		(0x0u<<18)
#define	RIF_IER2_IAIE82_B_0X1		(0x1u<<18)
#define	RIF_IER2_IAIE81_B_0X0		(0x0u<<17)
#define	RIF_IER2_IAIE81_B_0X1		(0x1u<<17)
#define	RIF_IER2_IAIE80_B_0X0		(0x0u<<16)
#define	RIF_IER2_IAIE80_B_0X1		(0x1u<<16)
#define	RIF_IER2_IAIE79_B_0X0		(0x0u<<15)
#define	RIF_IER2_IAIE79_B_0X1		(0x1u<<15)
#define	RIF_IER2_IAIE78_B_0X0		(0x0u<<14)
#define	RIF_IER2_IAIE78_B_0X1		(0x1u<<14)
#define	RIF_IER2_IAIE77_B_0X0		(0x0u<<13)
#define	RIF_IER2_IAIE77_B_0X1		(0x1u<<13)
#define	RIF_IER2_IAIE76_B_0X0		(0x0u<<12)
#define	RIF_IER2_IAIE76_B_0X1		(0x1u<<12)
#define	RIF_IER2_IAIE75_B_0X0		(0x0u<<11)
#define	RIF_IER2_IAIE75_B_0X1		(0x1u<<11)
#define	RIF_IER2_IAIE74_B_0X0		(0x0u<<10)
#define	RIF_IER2_IAIE74_B_0X1		(0x1u<<10)
#define	RIF_IER2_IAIE73_B_0X0		(0x0u<<9)
#define	RIF_IER2_IAIE73_B_0X1		(0x1u<<9)
#define	RIF_IER2_IAIE72_B_0X0		(0x0u<<8)
#define	RIF_IER2_IAIE72_B_0X1		(0x1u<<8)
#define	RIF_IER2_IAIE71_B_0X0		(0x0u<<7)
#define	RIF_IER2_IAIE71_B_0X1		(0x1u<<7)
#define	RIF_IER2_IAIE70_B_0X0		(0x0u<<6)
#define	RIF_IER2_IAIE70_B_0X1		(0x1u<<6)
#define	RIF_IER2_IAIE69_B_0X0		(0x0u<<5)
#define	RIF_IER2_IAIE69_B_0X1		(0x1u<<5)
#define	RIF_IER2_IAIE68_B_0X0		(0x0u<<4)
#define	RIF_IER2_IAIE68_B_0X1		(0x1u<<4)
#define	RIF_IER2_IAIE67_B_0X0		(0x0u<<3)
#define	RIF_IER2_IAIE67_B_0X1		(0x1u<<3)
#define	RIF_IER2_IAIE66_B_0X0		(0x0u<<2)
#define	RIF_IER2_IAIE66_B_0X1		(0x1u<<2)
#define	RIF_IER2_IAIE65_B_0X0		(0x0u<<1)
#define	RIF_IER2_IAIE65_B_0X1		(0x1u<<1)
#define	RIF_IER2_IAIE64_B_0X0		(0x0u<<0)
#define	RIF_IER2_IAIE64_B_0X1		(0x1u<<0)

// IER3 Configuration

