hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rif.h
#define	RIF_IER3_IAIE127			(0x1u<<31)
#define	RIF_IER3_IAIE126			(0x1u<<30)
#define	RIF_IER3_IAIE125			(0x1u<<29)
#define	RIF_IER3_IAIE124			(0x1u<<28)
#define	RIF_IER3_IAIE123			(0x1u<<27)
#define	RIF_IER3_IAIE122			(0x1u<<26)
#define	RIF_IER3_IAIE121			(0x1u<<25)
#define	RIF_IER3_IAIE120			(0x1u<<24)
#define	RIF_IER3_IAIE119			(0x1u<<23)
#define	RIF_IER3_IAIE118			(0x1u<<22)
#define	RIF_IER3_IAIE117			(0x1u<<21)
#define	RIF_IER3_IAIE116			(0x1u<<20)
#define	RIF_IER3_IAIE115			(0x1u<<19)
#define	RIF_IER3_IAIE114			(0x1u<<18)
#define	RIF_IER3_IAIE113			(0x1u<<17)
#define	RIF_IER3_IAIE112			(0x1u<<16)
#define	RIF_IER3_IAIE111			(0x1u<<15)
#define	RIF_IER3_IAIE110			(0x1u<<14)
#define	RIF_IER3_IAIE109			(0x1u<<13)
#define	RIF_IER3_IAIE108			(0x1u<<12)
#define	RIF_IER3_IAIE107			(0x1u<<11)
#define	RIF_IER3_IAIE106			(0x1u<<10)
#define	RIF_IER3_IAIE105			(0x1u<<9)
#define	RIF_IER3_IAIE104			(0x1u<<8)
#define	RIF_IER3_IAIE103			(0x1u<<7)
#define	RIF_IER3_IAIE102			(0x1u<<6)
#define	RIF_IER3_IAIE101			(0x1u<<5)
#define	RIF_IER3_IAIE100			(0x1u<<4)
#define	RIF_IER3_IAIE99				(0x1u<<3)
#define	RIF_IER3_IAIE98				(0x1u<<2)
#define	RIF_IER3_IAIE97				(0x1u<<1)
#define	RIF_IER3_IAIE96				(0x1u<<0)

#define	RIF_IER3_IAIE127_B_0X0		(0x0u<<31)
#define	RIF_IER3_IAIE127_B_0X1		(0x1u<<31)
#define	RIF_IER3_IAIE126_B_0X0		(0x0u<<30)
#define	RIF_IER3_IAIE126_B_0X1		(0x1u<<30)
#define	RIF_IER3_IAIE125_B_0X0		(0x0u<<29)
#define	RIF_IER3_IAIE125_B_0X1		(0x1u<<29)
#define	RIF_IER3_IAIE124_B_0X0		(0x0u<<28)
#define	RIF_IER3_IAIE124_B_0X1		(0x1u<<28)
#define	RIF_IER3_IAIE123_B_0X0		(0x0u<<27)
#define	RIF_IER3_IAIE123_B_0X1		(0x1u<<27)
#define	RIF_IER3_IAIE122_B_0X0		(0x0u<<26)
#define	RIF_IER3_IAIE122_B_0X1		(0x1u<<26)
#define	RIF_IER3_IAIE121_B_0X0		(0x0u<<25)
#define	RIF_IER3_IAIE121_B_0X1		(0x1u<<25)
#define	RIF_IER3_IAIE120_B_0X0		(0x0u<<24)
#define	RIF_IER3_IAIE120_B_0X1		(0x1u<<24)
#define	RIF_IER3_IAIE119_B_0X0		(0x0u<<23)
#define	RIF_IER3_IAIE119_B_0X1		(0x1u<<23)
#define	RIF_IER3_IAIE118_B_0X0		(0x0u<<22)
#define	RIF_IER3_IAIE118_B_0X1		(0x1u<<22)
#define	RIF_IER3_IAIE117_B_0X0		(0x0u<<21)
#define	RIF_IER3_IAIE117_B_0X1		(0x1u<<21)
#define	RIF_IER3_IAIE116_B_0X0		(0x0u<<20)
#define	RIF_IER3_IAIE116_B_0X1		(0x1u<<20)
#define	RIF_IER3_IAIE115_B_0X0		(0x0u<<19)
#define	RIF_IER3_IAIE115_B_0X1		(0x1u<<19)
#define	RIF_IER3_IAIE114_B_0X0		(0x0u<<18)
#define	RIF_IER3_IAIE114_B_0X1		(0x1u<<18)
#define	RIF_IER3_IAIE113_B_0X0		(0x0u<<17)
#define	RIF_IER3_IAIE113_B_0X1		(0x1u<<17)
#define	RIF_IER3_IAIE112_B_0X0		(0x0u<<16)
#define	RIF_IER3_IAIE112_B_0X1		(0x1u<<16)
#define	RIF_IER3_IAIE111_B_0X0		(0x0u<<15)
#define	RIF_IER3_IAIE111_B_0X1		(0x1u<<15)
#define	RIF_IER3_IAIE110_B_0X0		(0x0u<<14)
#define	RIF_IER3_IAIE110_B_0X1		(0x1u<<14)
#define	RIF_IER3_IAIE109_B_0X0		(0x0u<<13)
#define	RIF_IER3_IAIE109_B_0X1		(0x1u<<13)
#define	RIF_IER3_IAIE108_B_0X0		(0x0u<<12)
#define	RIF_IER3_IAIE108_B_0X1		(0x1u<<12)
#define	RIF_IER3_IAIE107_B_0X0		(0x0u<<11)
#define	RIF_IER3_IAIE107_B_0X1		(0x1u<<11)
#define	RIF_IER3_IAIE106_B_0X0		(0x0u<<10)
#define	RIF_IER3_IAIE106_B_0X1		(0x1u<<10)
#define	RIF_IER3_IAIE105_B_0X0		(0x0u<<9)
#define	RIF_IER3_IAIE105_B_0X1		(0x1u<<9)
#define	RIF_IER3_IAIE104_B_0X0		(0x0u<<8)
#define	RIF_IER3_IAIE104_B_0X1		(0x1u<<8)
#define	RIF_IER3_IAIE103_B_0X0		(0x0u<<7)
#define	RIF_IER3_IAIE103_B_0X1		(0x1u<<7)
#define	RIF_IER3_IAIE102_B_0X0		(0x0u<<6)
#define	RIF_IER3_IAIE102_B_0X1		(0x1u<<6)
#define	RIF_IER3_IAIE101_B_0X0		(0x0u<<5)
#define	RIF_IER3_IAIE101_B_0X1		(0x1u<<5)
#define	RIF_IER3_IAIE100_B_0X0		(0x0u<<4)
#define	RIF_IER3_IAIE100_B_0X1		(0x1u<<4)
#define	RIF_IER3_IAIE99_B_0X0		(0x0u<<3)
#define	RIF_IER3_IAIE99_B_0X1		(0x1u<<3)
#define	RIF_IER3_IAIE98_B_0X0		(0x0u<<2)
#define	RIF_IER3_IAIE98_B_0X1		(0x1u<<2)
#define	RIF_IER3_IAIE97_B_0X0		(0x0u<<1)
#define	RIF_IER3_IAIE97_B_0X1		(0x1u<<1)
#define	RIF_IER3_IAIE96_B_0X0		(0x0u<<0)
#define	RIF_IER3_IAIE96_B_0X1		(0x1u<<0)

// IER4 Configuration

#define	RIF_IER4_IAIE159			(0x1u<<31)
#define	RIF_IER4_IAIE158			(0x1u<<30)
#define	RIF_IER4_IAIE157			(0x1u<<29)
#define	RIF_IER4_IAIE156			(0x1u<<28)
#define	RIF_IER4_IAIE155			(0x1u<<27)
#define	RIF_IER4_IAIE154			(0x1u<<26)
#define	RIF_IER4_IAIE153			(0x1u<<25)
#define	RIF_IER4_IAIE152			(0x1u<<24)
#define	RIF_IER4_IAIE151			(0x1u<<23)
#define	RIF_IER4_IAIE150			(0x1u<<22)
#define	RIF_IER4_IAIE149			(0x1u<<21)
#define	RIF_IER4_IAIE148			(0x1u<<20)
#define	RIF_IER4_IAIE147			(0x1u<<19)
#define	RIF_IER4_IAIE146			(0x1u<<18)
#define	RIF_IER4_IAIE145			(0x1u<<17)
#define	RIF_IER4_IAIE144			(0x1u<<16)
#define	RIF_IER4_IAIE143			(0x1u<<15)
#define	RIF_IER4_IAIE142			(0x1u<<14)
#define	RIF_IER4_IAIE141			(0x1u<<13)
#define	RIF_IER4_IAIE140			(0x1u<<12)
#define	RIF_IER4_IAIE139			(0x1u<<11)
#define	RIF_IER4_IAIE138			(0x1u<<10)
#define	RIF_IER4_IAIE137			(0x1u<<9)
#define	RIF_IER4_IAIE136			(0x1u<<8)
#define	RIF_IER4_IAIE135			(0x1u<<7)
#define	RIF_IER4_IAIE134			(0x1u<<6)
#define	RIF_IER4_IAIE133			(0x1u<<5)
#define	RIF_IER4_IAIE132			(0x1u<<4)
#define	RIF_IER4_IAIE131			(0x1u<<3)
#define	RIF_IER4_IAIE130			(0x1u<<2)
#define	RIF_IER4_IAIE129			(0x1u<<1)
#define	RIF_IER4_IAIE128			(0x1u<<0)

#define	RIF_IER4_IAIE159_B_0X0		(0x0u<<31)
#define	RIF_IER4_IAIE159_B_0X1		(0x1u<<31)
#define	RIF_IER4_IAIE158_B_0X0		(0x0u<<30)
#define	RIF_IER4_IAIE158_B_0X1		(0x1u<<30)
#define	RIF_IER4_IAIE157_B_0X0		(0x0u<<29)
#define	RIF_IER4_IAIE157_B_0X1		(0x1u<<29)
#define	RIF_IER4_IAIE156_B_0X0		(0x0u<<28)
#define	RIF_IER4_IAIE156_B_0X1		(0x1u<<28)
#define	RIF_IER4_IAIE155_B_0X0		(0x0u<<27)
#define	RIF_IER4_IAIE155_B_0X1		(0x1u<<27)
#define	RIF_IER4_IAIE154_B_0X0		(0x0u<<26)
#define	RIF_IER4_IAIE154_B_0X1		(0x1u<<26)
#define	RIF_IER4_IAIE153_B_0X0		(0x0u<<25)
#define	RIF_IER4_IAIE153_B_0X1		(0x1u<<25)
#define	RIF_IER4_IAIE152_B_0X0		(0x0u<<24)
#define	RIF_IER4_IAIE152_B_0X1		(0x1u<<24)
#define	RIF_IER4_IAIE151_B_0X0		(0x0u<<23)
#define	RIF_IER4_IAIE151_B_0X1		(0x1u<<23)
#define	RIF_IER4_IAIE150_B_0X0		(0x0u<<22)
#define	RIF_IER4_IAIE150_B_0X1		(0x1u<<22)
#define	RIF_IER4_IAIE149_B_0X0		(0x0u<<21)
#define	RIF_IER4_IAIE149_B_0X1		(0x1u<<21)
#define	RIF_IER4_IAIE148_B_0X0		(0x0u<<20)
#define	RIF_IER4_IAIE148_B_0X1		(0x1u<<20)
#define	RIF_IER4_IAIE147_B_0X0		(0x0u<<19)
#define	RIF_IER4_IAIE147_B_0X1		(0x1u<<19)
#define	RIF_IER4_IAIE146_B_0X0		(0x0u<<18)
#define	RIF_IER4_IAIE146_B_0X1		(0x1u<<18)
#define	RIF_IER4_IAIE145_B_0X0		(0x0u<<17)
#define	RIF_IER4_IAIE145_B_0X1		(0x1u<<17)
#define	RIF_IER4_IAIE144_B_0X0		(0x0u<<16)
#define	RIF_IER4_IAIE144_B_0X1		(0x1u<<16)
#define	RIF_IER4_IAIE143_B_0X0		(0x0u<<15)
#define	RIF_IER4_IAIE143_B_0X1		(0x1u<<15)
#define	RIF_IER4_IAIE142_B_0X0		(0x0u<<14)
#define	RIF_IER4_IAIE142_B_0X1		(0x1u<<14)
#define	RIF_IER4_IAIE141_B_0X0		(0x0u<<13)
#define	RIF_IER4_IAIE141_B_0X1		(0x1u<<13)
#define	RIF_IER4_IAIE140_B_0X0		(0x0u<<12)
#define	RIF_IER4_IAIE140_B_0X1		(0x1u<<12)
#define	RIF_IER4_IAIE139_B_0X0		(0x0u<<11)
#define	RIF_IER4_IAIE139_B_0X1		(0x1u<<11)
#define	RIF_IER4_IAIE138_B_0X0		(0x0u<<10)
#define	RIF_IER4_IAIE138_B_0X1		(0x1u<<10)
#define	RIF_IER4_IAIE137_B_0X0		(0x0u<<9)
#define	RIF_IER4_IAIE137_B_0X1		(0x1u<<9)
#define	RIF_IER4_IAIE136_B_0X0		(0x0u<<8)
#define	RIF_IER4_IAIE136_B_0X1		(0x1u<<8)
#define	RIF_IER4_IAIE135_B_0X0		(0x0u<<7)
#define	RIF_IER4_IAIE135_B_0X1		(0x1u<<7)
#define	RIF_IER4_IAIE134_B_0X0		(0x0u<<6)
#define	RIF_IER4_IAIE134_B_0X1		(0x1u<<6)
#define	RIF_IER4_IAIE133_B_0X0		(0x0u<<5)
#define	RIF_IER4_IAIE133_B_0X1		(0x1u<<5)
#define	RIF_IER4_IAIE132_B_0X0		(0x0u<<4)
#define	RIF_IER4_IAIE132_B_0X1		(0x1u<<4)
#define	RIF_IER4_IAIE131_B_0X0		(0x0u<<3)
#define	RIF_IER4_IAIE131_B_0X1		(0x1u<<3)
#define	RIF_IER4_IAIE130_B_0X0		(0x0u<<2)
#define	RIF_IER4_IAIE130_B_0X1		(0x1u<<2)
#define	RIF_IER4_IAIE129_B_0X0		(0x0u<<1)
#define	RIF_IER4_IAIE129_B_0X1		(0x1u<<1)
#define	RIF_IER4_IAIE128_B_0X0		(0x0u<<0)
#define	RIF_IER4_IAIE128_B_0X1		(0x1u<<0)

// IER5 Configuration

