hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rif.h
#define	RIF_IER5_IAIE191			(0x1u<<31)
#define	RIF_IER5_IAIE190			(0x1u<<30)
#define	RIF_IER5_IAIE189			(0x1u<<29)
#define	RIF_IER5_IAIE188			(0x1u<<28)
#define	RIF_IER5_IAIE187			(0x1u<<27)
#define	RIF_IER5_IAIE186			(0x1u<<26)
#define	RIF_IER5_IAIE185			(0x1u<<25)
#define	RIF_IER5_IAIE184			(0x1u<<24)
#define	RIF_IER5_IAIE183			(0x1u<<23)
#define	RIF_IER5_IAIE182			(0x1u<<22)
#define	RIF_IER5_IAIE181			(0x1u<<21)
#define	RIF_IER5_IAIE180			(0x1u<<20)
#define	RIF_IER5_IAIE179			(0x1u<<19)
#define	RIF_IER5_IAIE178			(0x1u<<18)
#define	RIF_IER5_IAIE177			(0x1u<<17)
#define	RIF_IER5_IAIE176			(0x1u<<16)
#define	RIF_IER5_IAIE175			(0x1u<<15)
#define	RIF_IER5_IAIE174			(0x1u<<14)
#define	RIF_IER5_IAIE173			(0x1u<<13)
#define	RIF_IER5_IAIE172			(0x1u<<12)
#define	RIF_IER5_IAIE171			(0x1u<<11)
#define	RIF_IER5_IAIE170			(0x1u<<10)
#define	RIF_IER5_IAIE169			(0x1u<<9)
#define	RIF_IER5_IAIE168			(0x1u<<8)
#define	RIF_IER5_IAIE167			(0x1u<<7)
#define	RIF_IER5_IAIE166			(0x1u<<6)
#define	RIF_IER5_IAIE165			(0x1u<<5)
#define	RIF_IER5_IAIE164			(0x1u<<4)
#define	RIF_IER5_IAIE163			(0x1u<<3)
#define	RIF_IER5_IAIE162			(0x1u<<2)
#define	RIF_IER5_IAIE161			(0x1u<<1)
#define	RIF_IER5_IAIE160			(0x1u<<0)

#define	RIF_IER5_IAIE191_B_0X0		(0x0u<<31)
#define	RIF_IER5_IAIE191_B_0X1		(0x1u<<31)
#define	RIF_IER5_IAIE190_B_0X0		(0x0u<<30)
#define	RIF_IER5_IAIE190_B_0X1		(0x1u<<30)
#define	RIF_IER5_IAIE189_B_0X0		(0x0u<<29)
#define	RIF_IER5_IAIE189_B_0X1		(0x1u<<29)
#define	RIF_IER5_IAIE188_B_0X0		(0x0u<<28)
#define	RIF_IER5_IAIE188_B_0X1		(0x1u<<28)
#define	RIF_IER5_IAIE187_B_0X0		(0x0u<<27)
#define	RIF_IER5_IAIE187_B_0X1		(0x1u<<27)
#define	RIF_IER5_IAIE186_B_0X0		(0x0u<<26)
#define	RIF_IER5_IAIE186_B_0X1		(0x1u<<26)
#define	RIF_IER5_IAIE185_B_0X0		(0x0u<<25)
#define	RIF_IER5_IAIE185_B_0X1		(0x1u<<25)
#define	RIF_IER5_IAIE184_B_0X0		(0x0u<<24)
#define	RIF_IER5_IAIE184_B_0X1		(0x1u<<24)
#define	RIF_IER5_IAIE183_B_0X0		(0x0u<<23)
#define	RIF_IER5_IAIE183_B_0X1		(0x1u<<23)
#define	RIF_IER5_IAIE182_B_0X0		(0x0u<<22)
#define	RIF_IER5_IAIE182_B_0X1		(0x1u<<22)
#define	RIF_IER5_IAIE181_B_0X0		(0x0u<<21)
#define	RIF_IER5_IAIE181_B_0X1		(0x1u<<21)
#define	RIF_IER5_IAIE180_B_0X0		(0x0u<<20)
#define	RIF_IER5_IAIE180_B_0X1		(0x1u<<20)
#define	RIF_IER5_IAIE179_B_0X0		(0x0u<<19)
#define	RIF_IER5_IAIE179_B_0X1		(0x1u<<19)
#define	RIF_IER5_IAIE178_B_0X0		(0x0u<<18)
#define	RIF_IER5_IAIE178_B_0X1		(0x1u<<18)
#define	RIF_IER5_IAIE177_B_0X0		(0x0u<<17)
#define	RIF_IER5_IAIE177_B_0X1		(0x1u<<17)
#define	RIF_IER5_IAIE176_B_0X0		(0x0u<<16)
#define	RIF_IER5_IAIE176_B_0X1		(0x1u<<16)
#define	RIF_IER5_IAIE175_B_0X0		(0x0u<<15)
#define	RIF_IER5_IAIE175_B_0X1		(0x1u<<15)
#define	RIF_IER5_IAIE174_B_0X0		(0x0u<<14)
#define	RIF_IER5_IAIE174_B_0X1		(0x1u<<14)
#define	RIF_IER5_IAIE173_B_0X0		(0x0u<<13)
#define	RIF_IER5_IAIE173_B_0X1		(0x1u<<13)
#define	RIF_IER5_IAIE172_B_0X0		(0x0u<<12)
#define	RIF_IER5_IAIE172_B_0X1		(0x1u<<12)
#define	RIF_IER5_IAIE171_B_0X0		(0x0u<<11)
#define	RIF_IER5_IAIE171_B_0X1		(0x1u<<11)
#define	RIF_IER5_IAIE170_B_0X0		(0x0u<<10)
#define	RIF_IER5_IAIE170_B_0X1		(0x1u<<10)
#define	RIF_IER5_IAIE169_B_0X0		(0x0u<<9)
#define	RIF_IER5_IAIE169_B_0X1		(0x1u<<9)
#define	RIF_IER5_IAIE168_B_0X0		(0x0u<<8)
#define	RIF_IER5_IAIE168_B_0X1		(0x1u<<8)
#define	RIF_IER5_IAIE167_B_0X0		(0x0u<<7)
#define	RIF_IER5_IAIE167_B_0X1		(0x1u<<7)
#define	RIF_IER5_IAIE166_B_0X0		(0x0u<<6)
#define	RIF_IER5_IAIE166_B_0X1		(0x1u<<6)
#define	RIF_IER5_IAIE165_B_0X0		(0x0u<<5)
#define	RIF_IER5_IAIE165_B_0X1		(0x1u<<5)
#define	RIF_IER5_IAIE164_B_0X0		(0x0u<<4)
#define	RIF_IER5_IAIE164_B_0X1		(0x1u<<4)
#define	RIF_IER5_IAIE163_B_0X0		(0x0u<<3)
#define	RIF_IER5_IAIE163_B_0X1		(0x1u<<3)
#define	RIF_IER5_IAIE162_B_0X0		(0x0u<<2)
#define	RIF_IER5_IAIE162_B_0X1		(0x1u<<2)
#define	RIF_IER5_IAIE161_B_0X0		(0x0u<<1)
#define	RIF_IER5_IAIE161_B_0X1		(0x1u<<1)
#define	RIF_IER5_IAIE160_B_0X0		(0x0u<<0)
#define	RIF_IER5_IAIE160_B_0X1		(0x1u<<0)

// ISR0 Configuration

#define	RIF_ISR0_IAF31				(0x1u<<31)
#define	RIF_ISR0_IAF30				(0x1u<<30)
#define	RIF_ISR0_IAF29				(0x1u<<29)
#define	RIF_ISR0_IAF28				(0x1u<<28)
#define	RIF_ISR0_IAF27				(0x1u<<27)
#define	RIF_ISR0_IAF26				(0x1u<<26)
#define	RIF_ISR0_IAF25				(0x1u<<25)
#define	RIF_ISR0_IAF24				(0x1u<<24)
#define	RIF_ISR0_IAF23				(0x1u<<23)
#define	RIF_ISR0_IAF22				(0x1u<<22)
#define	RIF_ISR0_IAF21				(0x1u<<21)
#define	RIF_ISR0_IAF20				(0x1u<<20)
#define	RIF_ISR0_IAF19				(0x1u<<19)
#define	RIF_ISR0_IAF18				(0x1u<<18)
#define	RIF_ISR0_IAF17				(0x1u<<17)
#define	RIF_ISR0_IAF16				(0x1u<<16)
#define	RIF_ISR0_IAF15				(0x1u<<15)
#define	RIF_ISR0_IAF14				(0x1u<<14)
#define	RIF_ISR0_IAF13				(0x1u<<13)
#define	RIF_ISR0_IAF12				(0x1u<<12)
#define	RIF_ISR0_IAF11				(0x1u<<11)
#define	RIF_ISR0_IAF10				(0x1u<<10)
#define	RIF_ISR0_IAF9				(0x1u<<9)
#define	RIF_ISR0_IAF8				(0x1u<<8)
#define	RIF_ISR0_IAF7				(0x1u<<7)
#define	RIF_ISR0_IAF6				(0x1u<<6)
#define	RIF_ISR0_IAF5				(0x1u<<5)
#define	RIF_ISR0_IAF4				(0x1u<<4)
#define	RIF_ISR0_IAF3				(0x1u<<3)
#define	RIF_ISR0_IAF2				(0x1u<<2)
#define	RIF_ISR0_IAF1				(0x1u<<1)
#define	RIF_ISR0_IAF0				(0x1u<<0)

#define	RIF_ISR0_IAF31_B_0X0		(0x0u<<31)
#define	RIF_ISR0_IAF31_B_0X1		(0x1u<<31)
#define	RIF_ISR0_IAF30_B_0X0		(0x0u<<30)
#define	RIF_ISR0_IAF30_B_0X1		(0x1u<<30)
#define	RIF_ISR0_IAF29_B_0X0		(0x0u<<29)
#define	RIF_ISR0_IAF29_B_0X1		(0x1u<<29)
#define	RIF_ISR0_IAF28_B_0X0		(0x0u<<28)
#define	RIF_ISR0_IAF28_B_0X1		(0x1u<<28)
#define	RIF_ISR0_IAF27_B_0X0		(0x0u<<27)
#define	RIF_ISR0_IAF27_B_0X1		(0x1u<<27)
#define	RIF_ISR0_IAF26_B_0X0		(0x0u<<26)
#define	RIF_ISR0_IAF26_B_0X1		(0x1u<<26)
#define	RIF_ISR0_IAF25_B_0X0		(0x0u<<25)
#define	RIF_ISR0_IAF25_B_0X1		(0x1u<<25)
#define	RIF_ISR0_IAF24_B_0X0		(0x0u<<24)
#define	RIF_ISR0_IAF24_B_0X1		(0x1u<<24)
#define	RIF_ISR0_IAF23_B_0X0		(0x0u<<23)
#define	RIF_ISR0_IAF23_B_0X1		(0x1u<<23)
#define	RIF_ISR0_IAF22_B_0X0		(0x0u<<22)
#define	RIF_ISR0_IAF22_B_0X1		(0x1u<<22)
#define	RIF_ISR0_IAF21_B_0X0		(0x0u<<21)
#define	RIF_ISR0_IAF21_B_0X1		(0x1u<<21)
#define	RIF_ISR0_IAF20_B_0X0		(0x0u<<20)
#define	RIF_ISR0_IAF20_B_0X1		(0x1u<<20)
#define	RIF_ISR0_IAF19_B_0X0		(0x0u<<19)
#define	RIF_ISR0_IAF19_B_0X1		(0x1u<<19)
#define	RIF_ISR0_IAF18_B_0X0		(0x0u<<18)
#define	RIF_ISR0_IAF18_B_0X1		(0x1u<<18)
#define	RIF_ISR0_IAF17_B_0X0		(0x0u<<17)
#define	RIF_ISR0_IAF17_B_0X1		(0x1u<<17)
#define	RIF_ISR0_IAF16_B_0X0		(0x0u<<16)
#define	RIF_ISR0_IAF16_B_0X1		(0x1u<<16)
#define	RIF_ISR0_IAF15_B_0X0		(0x0u<<15)
#define	RIF_ISR0_IAF15_B_0X1		(0x1u<<15)
#define	RIF_ISR0_IAF14_B_0X0		(0x0u<<14)
#define	RIF_ISR0_IAF14_B_0X1		(0x1u<<14)
#define	RIF_ISR0_IAF13_B_0X0		(0x0u<<13)
#define	RIF_ISR0_IAF13_B_0X1		(0x1u<<13)
#define	RIF_ISR0_IAF12_B_0X0		(0x0u<<12)
#define	RIF_ISR0_IAF12_B_0X1		(0x1u<<12)
#define	RIF_ISR0_IAF11_B_0X0		(0x0u<<11)
#define	RIF_ISR0_IAF11_B_0X1		(0x1u<<11)
#define	RIF_ISR0_IAF10_B_0X0		(0x0u<<10)
#define	RIF_ISR0_IAF10_B_0X1		(0x1u<<10)
#define	RIF_ISR0_IAF9_B_0X0			(0x0u<<9)
#define	RIF_ISR0_IAF9_B_0X1			(0x1u<<9)
#define	RIF_ISR0_IAF8_B_0X0			(0x0u<<8)
#define	RIF_ISR0_IAF8_B_0X1			(0x1u<<8)
#define	RIF_ISR0_IAF7_B_0X0			(0x0u<<7)
#define	RIF_ISR0_IAF7_B_0X1			(0x1u<<7)
#define	RIF_ISR0_IAF6_B_0X0			(0x0u<<6)
#define	RIF_ISR0_IAF6_B_0X1			(0x1u<<6)
#define	RIF_ISR0_IAF5_B_0X0			(0x0u<<5)
#define	RIF_ISR0_IAF5_B_0X1			(0x1u<<5)
#define	RIF_ISR0_IAF4_B_0X0			(0x0u<<4)
#define	RIF_ISR0_IAF4_B_0X1			(0x1u<<4)
#define	RIF_ISR0_IAF3_B_0X0			(0x0u<<3)
#define	RIF_ISR0_IAF3_B_0X1			(0x1u<<3)
#define	RIF_ISR0_IAF2_B_0X0			(0x0u<<2)
#define	RIF_ISR0_IAF2_B_0X1			(0x1u<<2)
#define	RIF_ISR0_IAF1_B_0X0			(0x0u<<1)
#define	RIF_ISR0_IAF1_B_0X1			(0x1u<<1)
#define	RIF_ISR0_IAF0_B_0X0			(0x0u<<0)
#define	RIF_ISR0_IAF0_B_0X1			(0x1u<<0)

// ISR1 Configuration

