hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rif.h
#define	RIF_ISR1_IAF63				(0x1u<<31)
#define	RIF_ISR1_IAF62				(0x1u<<30)
#define	RIF_ISR1_IAF61				(0x1u<<29)
#define	RIF_ISR1_IAF60				(0x1u<<28)
#define	RIF_ISR1_IAF59				(0x1u<<27)
#define	RIF_ISR1_IAF58				(0x1u<<26)
#define	RIF_ISR1_IAF57				(0x1u<<25)
#define	RIF_ISR1_IAF56				(0x1u<<24)
#define	RIF_ISR1_IAF55				(0x1u<<23)
#define	RIF_ISR1_IAF54				(0x1u<<22)
#define	RIF_ISR1_IAF53				(0x1u<<21)
#define	RIF_ISR1_IAF52				(0x1u<<20)
#define	RIF_ISR1_IAF51				(0x1u<<19)
#define	RIF_ISR1_IAF50				(0x1u<<18)
#define	RIF_ISR1_IAF49				(0x1u<<17)
#define	RIF_ISR1_IAF48				(0x1u<<16)
#define	RIF_ISR1_IAF47				(0x1u<<15)
#define	RIF_ISR1_IAF46				(0x1u<<14)
#define	RIF_ISR1_IAF45				(0x1u<<13)
#define	RIF_ISR1_IAF44				(0x1u<<12)
#define	RIF_ISR1_IAF43				(0x1u<<11)
#define	RIF_ISR1_IAF42				(0x1u<<10)
#define	RIF_ISR1_IAF41				(0x1u<<9)
#define	RIF_ISR1_IAF40				(0x1u<<8)
#define	RIF_ISR1_IAF39				(0x1u<<7)
#define	RIF_ISR1_IAF38				(0x1u<<6)
#define	RIF_ISR1_IAF37				(0x1u<<5)
#define	RIF_ISR1_IAF36				(0x1u<<4)
#define	RIF_ISR1_IAF35				(0x1u<<3)
#define	RIF_ISR1_IAF34				(0x1u<<2)
#define	RIF_ISR1_IAF33				(0x1u<<1)
#define	RIF_ISR1_IAF32				(0x1u<<0)

#define	RIF_ISR1_IAF63_B_0X0		(0x0u<<31)
#define	RIF_ISR1_IAF63_B_0X1		(0x1u<<31)
#define	RIF_ISR1_IAF62_B_0X0		(0x0u<<30)
#define	RIF_ISR1_IAF62_B_0X1		(0x1u<<30)
#define	RIF_ISR1_IAF61_B_0X0		(0x0u<<29)
#define	RIF_ISR1_IAF61_B_0X1		(0x1u<<29)
#define	RIF_ISR1_IAF60_B_0X0		(0x0u<<28)
#define	RIF_ISR1_IAF60_B_0X1		(0x1u<<28)
#define	RIF_ISR1_IAF59_B_0X0		(0x0u<<27)
#define	RIF_ISR1_IAF59_B_0X1		(0x1u<<27)
#define	RIF_ISR1_IAF58_B_0X0		(0x0u<<26)
#define	RIF_ISR1_IAF58_B_0X1		(0x1u<<26)
#define	RIF_ISR1_IAF57_B_0X0		(0x0u<<25)
#define	RIF_ISR1_IAF57_B_0X1		(0x1u<<25)
#define	RIF_ISR1_IAF56_B_0X0		(0x0u<<24)
#define	RIF_ISR1_IAF56_B_0X1		(0x1u<<24)
#define	RIF_ISR1_IAF55_B_0X0		(0x0u<<23)
#define	RIF_ISR1_IAF55_B_0X1		(0x1u<<23)
#define	RIF_ISR1_IAF54_B_0X0		(0x0u<<22)
#define	RIF_ISR1_IAF54_B_0X1		(0x1u<<22)
#define	RIF_ISR1_IAF53_B_0X0		(0x0u<<21)
#define	RIF_ISR1_IAF53_B_0X1		(0x1u<<21)
#define	RIF_ISR1_IAF52_B_0X0		(0x0u<<20)
#define	RIF_ISR1_IAF52_B_0X1		(0x1u<<20)
#define	RIF_ISR1_IAF51_B_0X0		(0x0u<<19)
#define	RIF_ISR1_IAF51_B_0X1		(0x1u<<19)
#define	RIF_ISR1_IAF50_B_0X0		(0x0u<<18)
#define	RIF_ISR1_IAF50_B_0X1		(0x1u<<18)
#define	RIF_ISR1_IAF49_B_0X0		(0x0u<<17)
#define	RIF_ISR1_IAF49_B_0X1		(0x1u<<17)
#define	RIF_ISR1_IAF48_B_0X0		(0x0u<<16)
#define	RIF_ISR1_IAF48_B_0X1		(0x1u<<16)
#define	RIF_ISR1_IAF47_B_0X0		(0x0u<<15)
#define	RIF_ISR1_IAF47_B_0X1		(0x1u<<15)
#define	RIF_ISR1_IAF46_B_0X0		(0x0u<<14)
#define	RIF_ISR1_IAF46_B_0X1		(0x1u<<14)
#define	RIF_ISR1_IAF45_B_0X0		(0x0u<<13)
#define	RIF_ISR1_IAF45_B_0X1		(0x1u<<13)
#define	RIF_ISR1_IAF44_B_0X0		(0x0u<<12)
#define	RIF_ISR1_IAF44_B_0X1		(0x1u<<12)
#define	RIF_ISR1_IAF43_B_0X0		(0x0u<<11)
#define	RIF_ISR1_IAF43_B_0X1		(0x1u<<11)
#define	RIF_ISR1_IAF42_B_0X0		(0x0u<<10)
#define	RIF_ISR1_IAF42_B_0X1		(0x1u<<10)
#define	RIF_ISR1_IAF41_B_0X0		(0x0u<<9)
#define	RIF_ISR1_IAF41_B_0X1		(0x1u<<9)
#define	RIF_ISR1_IAF40_B_0X0		(0x0u<<8)
#define	RIF_ISR1_IAF40_B_0X1		(0x1u<<8)
#define	RIF_ISR1_IAF39_B_0X0		(0x0u<<7)
#define	RIF_ISR1_IAF39_B_0X1		(0x1u<<7)
#define	RIF_ISR1_IAF38_B_0X0		(0x0u<<6)
#define	RIF_ISR1_IAF38_B_0X1		(0x1u<<6)
#define	RIF_ISR1_IAF37_B_0X0		(0x0u<<5)
#define	RIF_ISR1_IAF37_B_0X1		(0x1u<<5)
#define	RIF_ISR1_IAF36_B_0X0		(0x0u<<4)
#define	RIF_ISR1_IAF36_B_0X1		(0x1u<<4)
#define	RIF_ISR1_IAF35_B_0X0		(0x0u<<3)
#define	RIF_ISR1_IAF35_B_0X1		(0x1u<<3)
#define	RIF_ISR1_IAF34_B_0X0		(0x0u<<2)
#define	RIF_ISR1_IAF34_B_0X1		(0x1u<<2)
#define	RIF_ISR1_IAF33_B_0X0		(0x0u<<1)
#define	RIF_ISR1_IAF33_B_0X1		(0x1u<<1)
#define	RIF_ISR1_IAF32_B_0X0		(0x0u<<0)
#define	RIF_ISR1_IAF32_B_0X1		(0x1u<<0)

// ISR2 Configuration

#define	RIF_ISR2_IAF95				(0x1u<<31)
#define	RIF_ISR2_IAF94				(0x1u<<30)
#define	RIF_ISR2_IAF93				(0x1u<<29)
#define	RIF_ISR2_IAF92				(0x1u<<28)
#define	RIF_ISR2_IAF91				(0x1u<<27)
#define	RIF_ISR2_IAF90				(0x1u<<26)
#define	RIF_ISR2_IAF89				(0x1u<<25)
#define	RIF_ISR2_IAF88				(0x1u<<24)
#define	RIF_ISR2_IAF87				(0x1u<<23)
#define	RIF_ISR2_IAF86				(0x1u<<22)
#define	RIF_ISR2_IAF85				(0x1u<<21)
#define	RIF_ISR2_IAF84				(0x1u<<20)
#define	RIF_ISR2_IAF83				(0x1u<<19)
#define	RIF_ISR2_IAF82				(0x1u<<18)
#define	RIF_ISR2_IAF81				(0x1u<<17)
#define	RIF_ISR2_IAF80				(0x1u<<16)
#define	RIF_ISR2_IAF79				(0x1u<<15)
#define	RIF_ISR2_IAF78				(0x1u<<14)
#define	RIF_ISR2_IAF77				(0x1u<<13)
#define	RIF_ISR2_IAF76				(0x1u<<12)
#define	RIF_ISR2_IAF75				(0x1u<<11)
#define	RIF_ISR2_IAF74				(0x1u<<10)
#define	RIF_ISR2_IAF73				(0x1u<<9)
#define	RIF_ISR2_IAF72				(0x1u<<8)
#define	RIF_ISR2_IAF71				(0x1u<<7)
#define	RIF_ISR2_IAF70				(0x1u<<6)
#define	RIF_ISR2_IAF69				(0x1u<<5)
#define	RIF_ISR2_IAF68				(0x1u<<4)
#define	RIF_ISR2_IAF67				(0x1u<<3)
#define	RIF_ISR2_IAF66				(0x1u<<2)
#define	RIF_ISR2_IAF65				(0x1u<<1)
#define	RIF_ISR2_IAF64				(0x1u<<0)

#define	RIF_ISR2_IAF95_B_0X0		(0x0u<<31)
#define	RIF_ISR2_IAF95_B_0X1		(0x1u<<31)
#define	RIF_ISR2_IAF94_B_0X0		(0x0u<<30)
#define	RIF_ISR2_IAF94_B_0X1		(0x1u<<30)
#define	RIF_ISR2_IAF93_B_0X0		(0x0u<<29)
#define	RIF_ISR2_IAF93_B_0X1		(0x1u<<29)
#define	RIF_ISR2_IAF92_B_0X0		(0x0u<<28)
#define	RIF_ISR2_IAF92_B_0X1		(0x1u<<28)
#define	RIF_ISR2_IAF91_B_0X0		(0x0u<<27)
#define	RIF_ISR2_IAF91_B_0X1		(0x1u<<27)
#define	RIF_ISR2_IAF90_B_0X0		(0x0u<<26)
#define	RIF_ISR2_IAF90_B_0X1		(0x1u<<26)
#define	RIF_ISR2_IAF89_B_0X0		(0x0u<<25)
#define	RIF_ISR2_IAF89_B_0X1		(0x1u<<25)
#define	RIF_ISR2_IAF88_B_0X0		(0x0u<<24)
#define	RIF_ISR2_IAF88_B_0X1		(0x1u<<24)
#define	RIF_ISR2_IAF87_B_0X0		(0x0u<<23)
#define	RIF_ISR2_IAF87_B_0X1		(0x1u<<23)
#define	RIF_ISR2_IAF86_B_0X0		(0x0u<<22)
#define	RIF_ISR2_IAF86_B_0X1		(0x1u<<22)
#define	RIF_ISR2_IAF85_B_0X0		(0x0u<<21)
#define	RIF_ISR2_IAF85_B_0X1		(0x1u<<21)
#define	RIF_ISR2_IAF84_B_0X0		(0x0u<<20)
#define	RIF_ISR2_IAF84_B_0X1		(0x1u<<20)
#define	RIF_ISR2_IAF83_B_0X0		(0x0u<<19)
#define	RIF_ISR2_IAF83_B_0X1		(0x1u<<19)
#define	RIF_ISR2_IAF82_B_0X0		(0x0u<<18)
#define	RIF_ISR2_IAF82_B_0X1		(0x1u<<18)
#define	RIF_ISR2_IAF81_B_0X0		(0x0u<<17)
#define	RIF_ISR2_IAF81_B_0X1		(0x1u<<17)
#define	RIF_ISR2_IAF80_B_0X0		(0x0u<<16)
#define	RIF_ISR2_IAF80_B_0X1		(0x1u<<16)
#define	RIF_ISR2_IAF79_B_0X0		(0x0u<<15)
#define	RIF_ISR2_IAF79_B_0X1		(0x1u<<15)
#define	RIF_ISR2_IAF78_B_0X0		(0x0u<<14)
#define	RIF_ISR2_IAF78_B_0X1		(0x1u<<14)
#define	RIF_ISR2_IAF77_B_0X0		(0x0u<<13)
#define	RIF_ISR2_IAF77_B_0X1		(0x1u<<13)
#define	RIF_ISR2_IAF76_B_0X0		(0x0u<<12)
#define	RIF_ISR2_IAF76_B_0X1		(0x1u<<12)
#define	RIF_ISR2_IAF75_B_0X0		(0x0u<<11)
#define	RIF_ISR2_IAF75_B_0X1		(0x1u<<11)
#define	RIF_ISR2_IAF74_B_0X0		(0x0u<<10)
#define	RIF_ISR2_IAF74_B_0X1		(0x1u<<10)
#define	RIF_ISR2_IAF73_B_0X0		(0x0u<<9)
#define	RIF_ISR2_IAF73_B_0X1		(0x1u<<9)
#define	RIF_ISR2_IAF72_B_0X0		(0x0u<<8)
#define	RIF_ISR2_IAF72_B_0X1		(0x1u<<8)
#define	RIF_ISR2_IAF71_B_0X0		(0x0u<<7)
#define	RIF_ISR2_IAF71_B_0X1		(0x1u<<7)
#define	RIF_ISR2_IAF70_B_0X0		(0x0u<<6)
#define	RIF_ISR2_IAF70_B_0X1		(0x1u<<6)
#define	RIF_ISR2_IAF69_B_0X0		(0x0u<<5)
#define	RIF_ISR2_IAF69_B_0X1		(0x1u<<5)
#define	RIF_ISR2_IAF68_B_0X0		(0x0u<<4)
#define	RIF_ISR2_IAF68_B_0X1		(0x1u<<4)
#define	RIF_ISR2_IAF67_B_0X0		(0x0u<<3)
#define	RIF_ISR2_IAF67_B_0X1		(0x1u<<3)
#define	RIF_ISR2_IAF66_B_0X0		(0x0u<<2)
#define	RIF_ISR2_IAF66_B_0X1		(0x1u<<2)
#define	RIF_ISR2_IAF65_B_0X0		(0x0u<<1)
#define	RIF_ISR2_IAF65_B_0X1		(0x1u<<1)
#define	RIF_ISR2_IAF64_B_0X0		(0x0u<<0)
#define	RIF_ISR2_IAF64_B_0X1		(0x1u<<0)

