hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rif.h
// ISR3 Configuration

#define	RIF_ISR3_IAF127				(0x1u<<31)
#define	RIF_ISR3_IAF126				(0x1u<<30)
#define	RIF_ISR3_IAF125				(0x1u<<29)
#define	RIF_ISR3_IAF124				(0x1u<<28)
#define	RIF_ISR3_IAF123				(0x1u<<27)
#define	RIF_ISR3_IAF122				(0x1u<<26)
#define	RIF_ISR3_IAF121				(0x1u<<25)
#define	RIF_ISR3_IAF120				(0x1u<<24)
#define	RIF_ISR3_IAF119				(0x1u<<23)
#define	RIF_ISR3_IAF118				(0x1u<<22)
#define	RIF_ISR3_IAF117				(0x1u<<21)
#define	RIF_ISR3_IAF116				(0x1u<<20)
#define	RIF_ISR3_IAF115				(0x1u<<19)
#define	RIF_ISR3_IAF114				(0x1u<<18)
#define	RIF_ISR3_IAF113				(0x1u<<17)
#define	RIF_ISR3_IAF112				(0x1u<<16)
#define	RIF_ISR3_IAF111				(0x1u<<15)
#define	RIF_ISR3_IAF110				(0x1u<<14)
#define	RIF_ISR3_IAF109				(0x1u<<13)
#define	RIF_ISR3_IAF108				(0x1u<<12)
#define	RIF_ISR3_IAF107				(0x1u<<11)
#define	RIF_ISR3_IAF106				(0x1u<<10)
#define	RIF_ISR3_IAF105				(0x1u<<9)
#define	RIF_ISR3_IAF104				(0x1u<<8)
#define	RIF_ISR3_IAF103				(0x1u<<7)
#define	RIF_ISR3_IAF102				(0x1u<<6)
#define	RIF_ISR3_IAF101				(0x1u<<5)
#define	RIF_ISR3_IAF100				(0x1u<<4)
#define	RIF_ISR3_IAF99				(0x1u<<3)
#define	RIF_ISR3_IAF98				(0x1u<<2)
#define	RIF_ISR3_IAF97				(0x1u<<1)
#define	RIF_ISR3_IAF96				(0x1u<<0)

#define	RIF_ISR3_IAF127_B_0X0		(0x0u<<31)
#define	RIF_ISR3_IAF127_B_0X1		(0x1u<<31)
#define	RIF_ISR3_IAF126_B_0X0		(0x0u<<30)
#define	RIF_ISR3_IAF126_B_0X1		(0x1u<<30)
#define	RIF_ISR3_IAF125_B_0X0		(0x0u<<29)
#define	RIF_ISR3_IAF125_B_0X1		(0x1u<<29)
#define	RIF_ISR3_IAF124_B_0X0		(0x0u<<28)
#define	RIF_ISR3_IAF124_B_0X1		(0x1u<<28)
#define	RIF_ISR3_IAF123_B_0X0		(0x0u<<27)
#define	RIF_ISR3_IAF123_B_0X1		(0x1u<<27)
#define	RIF_ISR3_IAF122_B_0X0		(0x0u<<26)
#define	RIF_ISR3_IAF122_B_0X1		(0x1u<<26)
#define	RIF_ISR3_IAF121_B_0X0		(0x0u<<25)
#define	RIF_ISR3_IAF121_B_0X1		(0x1u<<25)
#define	RIF_ISR3_IAF120_B_0X0		(0x0u<<24)
#define	RIF_ISR3_IAF120_B_0X1		(0x1u<<24)
#define	RIF_ISR3_IAF119_B_0X0		(0x0u<<23)
#define	RIF_ISR3_IAF119_B_0X1		(0x1u<<23)
#define	RIF_ISR3_IAF118_B_0X0		(0x0u<<22)
#define	RIF_ISR3_IAF118_B_0X1		(0x1u<<22)
#define	RIF_ISR3_IAF117_B_0X0		(0x0u<<21)
#define	RIF_ISR3_IAF117_B_0X1		(0x1u<<21)
#define	RIF_ISR3_IAF116_B_0X0		(0x0u<<20)
#define	RIF_ISR3_IAF116_B_0X1		(0x1u<<20)
#define	RIF_ISR3_IAF115_B_0X0		(0x0u<<19)
#define	RIF_ISR3_IAF115_B_0X1		(0x1u<<19)
#define	RIF_ISR3_IAF114_B_0X0		(0x0u<<18)
#define	RIF_ISR3_IAF114_B_0X1		(0x1u<<18)
#define	RIF_ISR3_IAF113_B_0X0		(0x0u<<17)
#define	RIF_ISR3_IAF113_B_0X1		(0x1u<<17)
#define	RIF_ISR3_IAF112_B_0X0		(0x0u<<16)
#define	RIF_ISR3_IAF112_B_0X1		(0x1u<<16)
#define	RIF_ISR3_IAF111_B_0X0		(0x0u<<15)
#define	RIF_ISR3_IAF111_B_0X1		(0x1u<<15)
#define	RIF_ISR3_IAF110_B_0X0		(0x0u<<14)
#define	RIF_ISR3_IAF110_B_0X1		(0x1u<<14)
#define	RIF_ISR3_IAF109_B_0X0		(0x0u<<13)
#define	RIF_ISR3_IAF109_B_0X1		(0x1u<<13)
#define	RIF_ISR3_IAF108_B_0X0		(0x0u<<12)
#define	RIF_ISR3_IAF108_B_0X1		(0x1u<<12)
#define	RIF_ISR3_IAF107_B_0X0		(0x0u<<11)
#define	RIF_ISR3_IAF107_B_0X1		(0x1u<<11)
#define	RIF_ISR3_IAF106_B_0X0		(0x0u<<10)
#define	RIF_ISR3_IAF106_B_0X1		(0x1u<<10)
#define	RIF_ISR3_IAF105_B_0X0		(0x0u<<9)
#define	RIF_ISR3_IAF105_B_0X1		(0x1u<<9)
#define	RIF_ISR3_IAF104_B_0X0		(0x0u<<8)
#define	RIF_ISR3_IAF104_B_0X1		(0x1u<<8)
#define	RIF_ISR3_IAF103_B_0X0		(0x0u<<7)
#define	RIF_ISR3_IAF103_B_0X1		(0x1u<<7)
#define	RIF_ISR3_IAF102_B_0X0		(0x0u<<6)
#define	RIF_ISR3_IAF102_B_0X1		(0x1u<<6)
#define	RIF_ISR3_IAF101_B_0X0		(0x0u<<5)
#define	RIF_ISR3_IAF101_B_0X1		(0x1u<<5)
#define	RIF_ISR3_IAF100_B_0X0		(0x0u<<4)
#define	RIF_ISR3_IAF100_B_0X1		(0x1u<<4)
#define	RIF_ISR3_IAF99_B_0X0		(0x0u<<3)
#define	RIF_ISR3_IAF99_B_0X1		(0x1u<<3)
#define	RIF_ISR3_IAF98_B_0X0		(0x0u<<2)
#define	RIF_ISR3_IAF98_B_0X1		(0x1u<<2)
#define	RIF_ISR3_IAF97_B_0X0		(0x0u<<1)
#define	RIF_ISR3_IAF97_B_0X1		(0x1u<<1)
#define	RIF_ISR3_IAF96_B_0X0		(0x0u<<0)
#define	RIF_ISR3_IAF96_B_0X1		(0x1u<<0)

// ISR4 Configuration

#define	RIF_ISR4_IAF159				(0x1u<<31)
#define	RIF_ISR4_IAF158				(0x1u<<30)
#define	RIF_ISR4_IAF157				(0x1u<<29)
#define	RIF_ISR4_IAF156				(0x1u<<28)
#define	RIF_ISR4_IAF155				(0x1u<<27)
#define	RIF_ISR4_IAF154				(0x1u<<26)
#define	RIF_ISR4_IAF153				(0x1u<<25)
#define	RIF_ISR4_IAF152				(0x1u<<24)
#define	RIF_ISR4_IAF151				(0x1u<<23)
#define	RIF_ISR4_IAF150				(0x1u<<22)
#define	RIF_ISR4_IAF149				(0x1u<<21)
#define	RIF_ISR4_IAF148				(0x1u<<20)
#define	RIF_ISR4_IAF147				(0x1u<<19)
#define	RIF_ISR4_IAF146				(0x1u<<18)
#define	RIF_ISR4_IAF145				(0x1u<<17)
#define	RIF_ISR4_IAF144				(0x1u<<16)
#define	RIF_ISR4_IAF143				(0x1u<<15)
#define	RIF_ISR4_IAF142				(0x1u<<14)
#define	RIF_ISR4_IAF141				(0x1u<<13)
#define	RIF_ISR4_IAF140				(0x1u<<12)
#define	RIF_ISR4_IAF139				(0x1u<<11)
#define	RIF_ISR4_IAF138				(0x1u<<10)
#define	RIF_ISR4_IAF137				(0x1u<<9)
#define	RIF_ISR4_IAF136				(0x1u<<8)
#define	RIF_ISR4_IAF135				(0x1u<<7)
#define	RIF_ISR4_IAF134				(0x1u<<6)
#define	RIF_ISR4_IAF133				(0x1u<<5)
#define	RIF_ISR4_IAF132				(0x1u<<4)
#define	RIF_ISR4_IAF131				(0x1u<<3)
#define	RIF_ISR4_IAF130				(0x1u<<2)
#define	RIF_ISR4_IAF129				(0x1u<<1)
#define	RIF_ISR4_IAF128				(0x1u<<0)

#define	RIF_ISR4_IAF159_B_0X0		(0x0u<<31)
#define	RIF_ISR4_IAF159_B_0X1		(0x1u<<31)
#define	RIF_ISR4_IAF158_B_0X0		(0x0u<<30)
#define	RIF_ISR4_IAF158_B_0X1		(0x1u<<30)
#define	RIF_ISR4_IAF157_B_0X0		(0x0u<<29)
#define	RIF_ISR4_IAF157_B_0X1		(0x1u<<29)
#define	RIF_ISR4_IAF156_B_0X0		(0x0u<<28)
#define	RIF_ISR4_IAF156_B_0X1		(0x1u<<28)
#define	RIF_ISR4_IAF155_B_0X0		(0x0u<<27)
#define	RIF_ISR4_IAF155_B_0X1		(0x1u<<27)
#define	RIF_ISR4_IAF154_B_0X0		(0x0u<<26)
#define	RIF_ISR4_IAF154_B_0X1		(0x1u<<26)
#define	RIF_ISR4_IAF153_B_0X0		(0x0u<<25)
#define	RIF_ISR4_IAF153_B_0X1		(0x1u<<25)
#define	RIF_ISR4_IAF152_B_0X0		(0x0u<<24)
#define	RIF_ISR4_IAF152_B_0X1		(0x1u<<24)
#define	RIF_ISR4_IAF151_B_0X0		(0x0u<<23)
#define	RIF_ISR4_IAF151_B_0X1		(0x1u<<23)
#define	RIF_ISR4_IAF150_B_0X0		(0x0u<<22)
#define	RIF_ISR4_IAF150_B_0X1		(0x1u<<22)
#define	RIF_ISR4_IAF149_B_0X0		(0x0u<<21)
#define	RIF_ISR4_IAF149_B_0X1		(0x1u<<21)
#define	RIF_ISR4_IAF148_B_0X0		(0x0u<<20)
#define	RIF_ISR4_IAF148_B_0X1		(0x1u<<20)
#define	RIF_ISR4_IAF147_B_0X0		(0x0u<<19)
#define	RIF_ISR4_IAF147_B_0X1		(0x1u<<19)
#define	RIF_ISR4_IAF146_B_0X0		(0x0u<<18)
#define	RIF_ISR4_IAF146_B_0X1		(0x1u<<18)
#define	RIF_ISR4_IAF145_B_0X0		(0x0u<<17)
#define	RIF_ISR4_IAF145_B_0X1		(0x1u<<17)
#define	RIF_ISR4_IAF144_B_0X0		(0x0u<<16)
#define	RIF_ISR4_IAF144_B_0X1		(0x1u<<16)
#define	RIF_ISR4_IAF143_B_0X0		(0x0u<<15)
#define	RIF_ISR4_IAF143_B_0X1		(0x1u<<15)
#define	RIF_ISR4_IAF142_B_0X0		(0x0u<<14)
#define	RIF_ISR4_IAF142_B_0X1		(0x1u<<14)
#define	RIF_ISR4_IAF141_B_0X0		(0x0u<<13)
#define	RIF_ISR4_IAF141_B_0X1		(0x1u<<13)
#define	RIF_ISR4_IAF140_B_0X0		(0x0u<<12)
#define	RIF_ISR4_IAF140_B_0X1		(0x1u<<12)
#define	RIF_ISR4_IAF139_B_0X0		(0x0u<<11)
#define	RIF_ISR4_IAF139_B_0X1		(0x1u<<11)
#define	RIF_ISR4_IAF138_B_0X0		(0x0u<<10)
#define	RIF_ISR4_IAF138_B_0X1		(0x1u<<10)
#define	RIF_ISR4_IAF137_B_0X0		(0x0u<<9)
#define	RIF_ISR4_IAF137_B_0X1		(0x1u<<9)
#define	RIF_ISR4_IAF136_B_0X0		(0x0u<<8)
#define	RIF_ISR4_IAF136_B_0X1		(0x1u<<8)
#define	RIF_ISR4_IAF135_B_0X0		(0x0u<<7)
#define	RIF_ISR4_IAF135_B_0X1		(0x1u<<7)
#define	RIF_ISR4_IAF134_B_0X0		(0x0u<<6)
#define	RIF_ISR4_IAF134_B_0X1		(0x1u<<6)
#define	RIF_ISR4_IAF133_B_0X0		(0x0u<<5)
#define	RIF_ISR4_IAF133_B_0X1		(0x1u<<5)
#define	RIF_ISR4_IAF132_B_0X0		(0x0u<<4)
#define	RIF_ISR4_IAF132_B_0X1		(0x1u<<4)
#define	RIF_ISR4_IAF131_B_0X0		(0x0u<<3)
#define	RIF_ISR4_IAF131_B_0X1		(0x1u<<3)
#define	RIF_ISR4_IAF130_B_0X0		(0x0u<<2)
#define	RIF_ISR4_IAF130_B_0X1		(0x1u<<2)
#define	RIF_ISR4_IAF129_B_0X0		(0x0u<<1)
#define	RIF_ISR4_IAF129_B_0X1		(0x1u<<1)
#define	RIF_ISR4_IAF128_B_0X0		(0x0u<<0)
#define	RIF_ISR4_IAF128_B_0X1		(0x1u<<0)

// ISR5 Configuration

#define	RIF_ISR5_IAF191				(0x1u<<31)
#define	RIF_ISR5_IAF190				(0x1u<<30)
#define	RIF_ISR5_IAF189				(0x1u<<29)
#define	RIF_ISR5_IAF188				(0x1u<<28)
#define	RIF_ISR5_IAF187				(0x1u<<27)
#define	RIF_ISR5_IAF186				(0x1u<<26)
#define	RIF_ISR5_IAF185				(0x1u<<25)
#define	RIF_ISR5_IAF184				(0x1u<<24)
#define	RIF_ISR5_IAF183				(0x1u<<23)
#define	RIF_ISR5_IAF182				(0x1u<<22)
#define	RIF_ISR5_IAF181				(0x1u<<21)
#define	RIF_ISR5_IAF180				(0x1u<<20)
#define	RIF_ISR5_IAF179				(0x1u<<19)
#define	RIF_ISR5_IAF178				(0x1u<<18)
#define	RIF_ISR5_IAF177				(0x1u<<17)
#define	RIF_ISR5_IAF176				(0x1u<<16)
#define	RIF_ISR5_IAF175				(0x1u<<15)
#define	RIF_ISR5_IAF174				(0x1u<<14)
#define	RIF_ISR5_IAF173				(0x1u<<13)
#define	RIF_ISR5_IAF172				(0x1u<<12)
#define	RIF_ISR5_IAF171				(0x1u<<11)
#define	RIF_ISR5_IAF170				(0x1u<<10)
#define	RIF_ISR5_IAF169				(0x1u<<9)
#define	RIF_ISR5_IAF168				(0x1u<<8)
#define	RIF_ISR5_IAF167				(0x1u<<7)
#define	RIF_ISR5_IAF166				(0x1u<<6)
#define	RIF_ISR5_IAF165				(0x1u<<5)
#define	RIF_ISR5_IAF164				(0x1u<<4)
#define	RIF_ISR5_IAF163				(0x1u<<3)
#define	RIF_ISR5_IAF162				(0x1u<<2)
#define	RIF_ISR5_IAF161				(0x1u<<1)
#define	RIF_ISR5_IAF160				(0x1u<<0)

#define	RIF_ISR5_IAF191_B_0X0		(0x0u<<31)
#define	RIF_ISR5_IAF191_B_0X1		(0x1u<<31)
#define	RIF_ISR5_IAF190_B_0X0		(0x0u<<30)
#define	RIF_ISR5_IAF190_B_0X1		(0x1u<<30)
#define	RIF_ISR5_IAF189_B_0X0		(0x0u<<29)
#define	RIF_ISR5_IAF189_B_0X1		(0x1u<<29)
#define	RIF_ISR5_IAF188_B_0X0		(0x0u<<28)
#define	RIF_ISR5_IAF188_B_0X1		(0x1u<<28)
#define	RIF_ISR5_IAF187_B_0X0		(0x0u<<27)
#define	RIF_ISR5_IAF187_B_0X1		(0x1u<<27)
#define	RIF_ISR5_IAF186_B_0X0		(0x0u<<26)
#define	RIF_ISR5_IAF186_B_0X1		(0x1u<<26)
#define	RIF_ISR5_IAF185_B_0X0		(0x0u<<25)
#define	RIF_ISR5_IAF185_B_0X1		(0x1u<<25)
#define	RIF_ISR5_IAF184_B_0X0		(0x0u<<24)
#define	RIF_ISR5_IAF184_B_0X1		(0x1u<<24)
#define	RIF_ISR5_IAF183_B_0X0		(0x0u<<23)
#define	RIF_ISR5_IAF183_B_0X1		(0x1u<<23)
#define	RIF_ISR5_IAF182_B_0X0		(0x0u<<22)
#define	RIF_ISR5_IAF182_B_0X1		(0x1u<<22)
#define	RIF_ISR5_IAF181_B_0X0		(0x0u<<21)
#define	RIF_ISR5_IAF181_B_0X1		(0x1u<<21)
#define	RIF_ISR5_IAF180_B_0X0		(0x0u<<20)
#define	RIF_ISR5_IAF180_B_0X1		(0x1u<<20)
#define	RIF_ISR5_IAF179_B_0X0		(0x0u<<19)
#define	RIF_ISR5_IAF179_B_0X1		(0x1u<<19)
#define	RIF_ISR5_IAF178_B_0X0		(0x0u<<18)
#define	RIF_ISR5_IAF178_B_0X1		(0x1u<<18)
#define	RIF_ISR5_IAF177_B_0X0		(0x0u<<17)
#define	RIF_ISR5_IAF177_B_0X1		(0x1u<<17)
#define	RIF_ISR5_IAF176_B_0X0		(0x0u<<16)
#define	RIF_ISR5_IAF176_B_0X1		(0x1u<<16)
#define	RIF_ISR5_IAF175_B_0X0		(0x0u<<15)
#define	RIF_ISR5_IAF175_B_0X1		(0x1u<<15)
#define	RIF_ISR5_IAF174_B_0X0		(0x0u<<14)
#define	RIF_ISR5_IAF174_B_0X1		(0x1u<<14)
#define	RIF_ISR5_IAF173_B_0X0		(0x0u<<13)
#define	RIF_ISR5_IAF173_B_0X1		(0x1u<<13)
#define	RIF_ISR5_IAF172_B_0X0		(0x0u<<12)
#define	RIF_ISR5_IAF172_B_0X1		(0x1u<<12)
#define	RIF_ISR5_IAF171_B_0X0		(0x0u<<11)
#define	RIF_ISR5_IAF171_B_0X1		(0x1u<<11)
#define	RIF_ISR5_IAF170_B_0X0		(0x0u<<10)
#define	RIF_ISR5_IAF170_B_0X1		(0x1u<<10)
#define	RIF_ISR5_IAF169_B_0X0		(0x0u<<9)
#define	RIF_ISR5_IAF169_B_0X1		(0x1u<<9)
#define	RIF_ISR5_IAF168_B_0X0		(0x0u<<8)
#define	RIF_ISR5_IAF168_B_0X1		(0x1u<<8)
#define	RIF_ISR5_IAF167_B_0X0		(0x0u<<7)
#define	RIF_ISR5_IAF167_B_0X1		(0x1u<<7)
#define	RIF_ISR5_IAF166_B_0X0		(0x0u<<6)
#define	RIF_ISR5_IAF166_B_0X1		(0x1u<<6)
#define	RIF_ISR5_IAF165_B_0X0		(0x0u<<5)
#define	RIF_ISR5_IAF165_B_0X1		(0x1u<<5)
#define	RIF_ISR5_IAF164_B_0X0		(0x0u<<4)
#define	RIF_ISR5_IAF164_B_0X1		(0x1u<<4)
#define	RIF_ISR5_IAF163_B_0X0		(0x0u<<3)
#define	RIF_ISR5_IAF163_B_0X1		(0x1u<<3)
#define	RIF_ISR5_IAF162_B_0X0		(0x0u<<2)
#define	RIF_ISR5_IAF162_B_0X1		(0x1u<<2)
#define	RIF_ISR5_IAF161_B_0X0		(0x0u<<1)
#define	RIF_ISR5_IAF161_B_0X1		(0x1u<<1)
#define	RIF_ISR5_IAF160_B_0X0		(0x0u<<0)
#define	RIF_ISR5_IAF160_B_0X1		(0x1u<<0)

