hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rif.h
// IISR2 Configuration

#define	RIF_IISR2_ILACIN95			(0x1u<<31)
#define	RIF_IISR2_ILACIN94			(0x1u<<30)
#define	RIF_IISR2_ILACIN93			(0x1u<<29)
#define	RIF_IISR2_ILACIN92			(0x1u<<28)
#define	RIF_IISR2_ILACIN91			(0x1u<<27)
#define	RIF_IISR2_ILACIN90			(0x1u<<26)
#define	RIF_IISR2_ILACIN89			(0x1u<<25)
#define	RIF_IISR2_ILACIN88			(0x1u<<24)
#define	RIF_IISR2_ILACIN87			(0x1u<<23)
#define	RIF_IISR2_ILACIN86			(0x1u<<22)
#define	RIF_IISR2_ILACIN85			(0x1u<<21)
#define	RIF_IISR2_ILACIN84			(0x1u<<20)
#define	RIF_IISR2_ILACIN83			(0x1u<<19)
#define	RIF_IISR2_ILACIN82			(0x1u<<18)
#define	RIF_IISR2_ILACIN81			(0x1u<<17)
#define	RIF_IISR2_ILACIN80			(0x1u<<16)
#define	RIF_IISR2_ILACIN79			(0x1u<<15)
#define	RIF_IISR2_ILACIN78			(0x1u<<14)
#define	RIF_IISR2_ILACIN77			(0x1u<<13)
#define	RIF_IISR2_ILACIN76			(0x1u<<12)
#define	RIF_IISR2_ILACIN75			(0x1u<<11)
#define	RIF_IISR2_ILACIN74			(0x1u<<10)
#define	RIF_IISR2_ILACIN73			(0x1u<<9)
#define	RIF_IISR2_ILACIN72			(0x1u<<8)
#define	RIF_IISR2_ILACIN71			(0x1u<<7)
#define	RIF_IISR2_ILACIN70			(0x1u<<6)
#define	RIF_IISR2_ILACIN69			(0x1u<<5)
#define	RIF_IISR2_ILACIN68			(0x1u<<4)
#define	RIF_IISR2_ILACIN67			(0x1u<<3)
#define	RIF_IISR2_ILACIN66			(0x1u<<2)
#define	RIF_IISR2_ILACIN65			(0x1u<<1)
#define	RIF_IISR2_ILACIN64			(0x1u<<0)

#define	RIF_IISR2_ILACIN95_B_0X0	(0x0u<<31)
#define	RIF_IISR2_ILACIN95_B_0X1	(0x1u<<31)
#define	RIF_IISR2_ILACIN94_B_0X0	(0x0u<<30)
#define	RIF_IISR2_ILACIN94_B_0X1	(0x1u<<30)
#define	RIF_IISR2_ILACIN93_B_0X0	(0x0u<<29)
#define	RIF_IISR2_ILACIN93_B_0X1	(0x1u<<29)
#define	RIF_IISR2_ILACIN92_B_0X0	(0x0u<<28)
#define	RIF_IISR2_ILACIN92_B_0X1	(0x1u<<28)
#define	RIF_IISR2_ILACIN91_B_0X0	(0x0u<<27)
#define	RIF_IISR2_ILACIN91_B_0X1	(0x1u<<27)
#define	RIF_IISR2_ILACIN90_B_0X0	(0x0u<<26)
#define	RIF_IISR2_ILACIN90_B_0X1	(0x1u<<26)
#define	RIF_IISR2_ILACIN89_B_0X0	(0x0u<<25)
#define	RIF_IISR2_ILACIN89_B_0X1	(0x1u<<25)
#define	RIF_IISR2_ILACIN88_B_0X0	(0x0u<<24)
#define	RIF_IISR2_ILACIN88_B_0X1	(0x1u<<24)
#define	RIF_IISR2_ILACIN87_B_0X0	(0x0u<<23)
#define	RIF_IISR2_ILACIN87_B_0X1	(0x1u<<23)
#define	RIF_IISR2_ILACIN86_B_0X0	(0x0u<<22)
#define	RIF_IISR2_ILACIN86_B_0X1	(0x1u<<22)
#define	RIF_IISR2_ILACIN85_B_0X0	(0x0u<<21)
#define	RIF_IISR2_ILACIN85_B_0X1	(0x1u<<21)
#define	RIF_IISR2_ILACIN84_B_0X0	(0x0u<<20)
#define	RIF_IISR2_ILACIN84_B_0X1	(0x1u<<20)
#define	RIF_IISR2_ILACIN83_B_0X0	(0x0u<<19)
#define	RIF_IISR2_ILACIN83_B_0X1	(0x1u<<19)
#define	RIF_IISR2_ILACIN82_B_0X0	(0x0u<<18)
#define	RIF_IISR2_ILACIN82_B_0X1	(0x1u<<18)
#define	RIF_IISR2_ILACIN81_B_0X0	(0x0u<<17)
#define	RIF_IISR2_ILACIN81_B_0X1	(0x1u<<17)
#define	RIF_IISR2_ILACIN80_B_0X0	(0x0u<<16)
#define	RIF_IISR2_ILACIN80_B_0X1	(0x1u<<16)
#define	RIF_IISR2_ILACIN79_B_0X0	(0x0u<<15)
#define	RIF_IISR2_ILACIN79_B_0X1	(0x1u<<15)
#define	RIF_IISR2_ILACIN78_B_0X0	(0x0u<<14)
#define	RIF_IISR2_ILACIN78_B_0X1	(0x1u<<14)
#define	RIF_IISR2_ILACIN77_B_0X0	(0x0u<<13)
#define	RIF_IISR2_ILACIN77_B_0X1	(0x1u<<13)
#define	RIF_IISR2_ILACIN76_B_0X0	(0x0u<<12)
#define	RIF_IISR2_ILACIN76_B_0X1	(0x1u<<12)
#define	RIF_IISR2_ILACIN75_B_0X0	(0x0u<<11)
#define	RIF_IISR2_ILACIN75_B_0X1	(0x1u<<11)
#define	RIF_IISR2_ILACIN74_B_0X0	(0x0u<<10)
#define	RIF_IISR2_ILACIN74_B_0X1	(0x1u<<10)
#define	RIF_IISR2_ILACIN73_B_0X0	(0x0u<<9)
#define	RIF_IISR2_ILACIN73_B_0X1	(0x1u<<9)
#define	RIF_IISR2_ILACIN72_B_0X0	(0x0u<<8)
#define	RIF_IISR2_ILACIN72_B_0X1	(0x1u<<8)
#define	RIF_IISR2_ILACIN71_B_0X0	(0x0u<<7)
#define	RIF_IISR2_ILACIN71_B_0X1	(0x1u<<7)
#define	RIF_IISR2_ILACIN70_B_0X0	(0x0u<<6)
#define	RIF_IISR2_ILACIN70_B_0X1	(0x1u<<6)
#define	RIF_IISR2_ILACIN69_B_0X0	(0x0u<<5)
#define	RIF_IISR2_ILACIN69_B_0X1	(0x1u<<5)
#define	RIF_IISR2_ILACIN68_B_0X0	(0x0u<<4)
#define	RIF_IISR2_ILACIN68_B_0X1	(0x1u<<4)
#define	RIF_IISR2_ILACIN67_B_0X0	(0x0u<<3)
#define	RIF_IISR2_ILACIN67_B_0X1	(0x1u<<3)
#define	RIF_IISR2_ILACIN66_B_0X0	(0x0u<<2)
#define	RIF_IISR2_ILACIN66_B_0X1	(0x1u<<2)
#define	RIF_IISR2_ILACIN65_B_0X0	(0x0u<<1)
#define	RIF_IISR2_ILACIN65_B_0X1	(0x1u<<1)
#define	RIF_IISR2_ILACIN64_B_0X0	(0x0u<<0)
#define	RIF_IISR2_ILACIN64_B_0X1	(0x1u<<0)

// IISR3 Configuration

#define	RIF_IISR3_ILACIN127			(0x1u<<31)
#define	RIF_IISR3_ILACIN126			(0x1u<<30)
#define	RIF_IISR3_ILACIN125			(0x1u<<29)
#define	RIF_IISR3_ILACIN124			(0x1u<<28)
#define	RIF_IISR3_ILACIN123			(0x1u<<27)
#define	RIF_IISR3_ILACIN122			(0x1u<<26)
#define	RIF_IISR3_ILACIN121			(0x1u<<25)
#define	RIF_IISR3_ILACIN120			(0x1u<<24)
#define	RIF_IISR3_ILACIN119			(0x1u<<23)
#define	RIF_IISR3_ILACIN118			(0x1u<<22)
#define	RIF_IISR3_ILACIN117			(0x1u<<21)
#define	RIF_IISR3_ILACIN116			(0x1u<<20)
#define	RIF_IISR3_ILACIN115			(0x1u<<19)
#define	RIF_IISR3_ILACIN114			(0x1u<<18)
#define	RIF_IISR3_ILACIN113			(0x1u<<17)
#define	RIF_IISR3_ILACIN112			(0x1u<<16)
#define	RIF_IISR3_ILACIN111			(0x1u<<15)
#define	RIF_IISR3_ILACIN110			(0x1u<<14)
#define	RIF_IISR3_ILACIN109			(0x1u<<13)
#define	RIF_IISR3_ILACIN108			(0x1u<<12)
#define	RIF_IISR3_ILACIN107			(0x1u<<11)
#define	RIF_IISR3_ILACIN106			(0x1u<<10)
#define	RIF_IISR3_ILACIN105			(0x1u<<9)
#define	RIF_IISR3_ILACIN104			(0x1u<<8)
#define	RIF_IISR3_ILACIN103			(0x1u<<7)
#define	RIF_IISR3_ILACIN102			(0x1u<<6)
#define	RIF_IISR3_ILACIN101			(0x1u<<5)
#define	RIF_IISR3_ILACIN100			(0x1u<<4)
#define	RIF_IISR3_ILACIN99			(0x1u<<3)
#define	RIF_IISR3_ILACIN98			(0x1u<<2)
#define	RIF_IISR3_ILACIN97			(0x1u<<1)
#define	RIF_IISR3_ILACIN96			(0x1u<<0)

#define	RIF_IISR3_ILACIN127_B_0X0	(0x0u<<31)
#define	RIF_IISR3_ILACIN127_B_0X1	(0x1u<<31)
#define	RIF_IISR3_ILACIN126_B_0X0	(0x0u<<30)
#define	RIF_IISR3_ILACIN126_B_0X1	(0x1u<<30)
#define	RIF_IISR3_ILACIN125_B_0X0	(0x0u<<29)
#define	RIF_IISR3_ILACIN125_B_0X1	(0x1u<<29)
#define	RIF_IISR3_ILACIN124_B_0X0	(0x0u<<28)
#define	RIF_IISR3_ILACIN124_B_0X1	(0x1u<<28)
#define	RIF_IISR3_ILACIN123_B_0X0	(0x0u<<27)
#define	RIF_IISR3_ILACIN123_B_0X1	(0x1u<<27)
#define	RIF_IISR3_ILACIN122_B_0X0	(0x0u<<26)
#define	RIF_IISR3_ILACIN122_B_0X1	(0x1u<<26)
#define	RIF_IISR3_ILACIN121_B_0X0	(0x0u<<25)
#define	RIF_IISR3_ILACIN121_B_0X1	(0x1u<<25)
#define	RIF_IISR3_ILACIN120_B_0X0	(0x0u<<24)
#define	RIF_IISR3_ILACIN120_B_0X1	(0x1u<<24)
#define	RIF_IISR3_ILACIN119_B_0X0	(0x0u<<23)
#define	RIF_IISR3_ILACIN119_B_0X1	(0x1u<<23)
#define	RIF_IISR3_ILACIN118_B_0X0	(0x0u<<22)
#define	RIF_IISR3_ILACIN118_B_0X1	(0x1u<<22)
#define	RIF_IISR3_ILACIN117_B_0X0	(0x0u<<21)
#define	RIF_IISR3_ILACIN117_B_0X1	(0x1u<<21)
#define	RIF_IISR3_ILACIN116_B_0X0	(0x0u<<20)
#define	RIF_IISR3_ILACIN116_B_0X1	(0x1u<<20)
#define	RIF_IISR3_ILACIN115_B_0X0	(0x0u<<19)
#define	RIF_IISR3_ILACIN115_B_0X1	(0x1u<<19)
#define	RIF_IISR3_ILACIN114_B_0X0	(0x0u<<18)
#define	RIF_IISR3_ILACIN114_B_0X1	(0x1u<<18)
#define	RIF_IISR3_ILACIN113_B_0X0	(0x0u<<17)
#define	RIF_IISR3_ILACIN113_B_0X1	(0x1u<<17)
#define	RIF_IISR3_ILACIN112_B_0X0	(0x0u<<16)
#define	RIF_IISR3_ILACIN112_B_0X1	(0x1u<<16)
#define	RIF_IISR3_ILACIN111_B_0X0	(0x0u<<15)
#define	RIF_IISR3_ILACIN111_B_0X1	(0x1u<<15)
#define	RIF_IISR3_ILACIN110_B_0X0	(0x0u<<14)
#define	RIF_IISR3_ILACIN110_B_0X1	(0x1u<<14)
#define	RIF_IISR3_ILACIN109_B_0X0	(0x0u<<13)
#define	RIF_IISR3_ILACIN109_B_0X1	(0x1u<<13)
#define	RIF_IISR3_ILACIN108_B_0X0	(0x0u<<12)
#define	RIF_IISR3_ILACIN108_B_0X1	(0x1u<<12)
#define	RIF_IISR3_ILACIN107_B_0X0	(0x0u<<11)
#define	RIF_IISR3_ILACIN107_B_0X1	(0x1u<<11)
#define	RIF_IISR3_ILACIN106_B_0X0	(0x0u<<10)
#define	RIF_IISR3_ILACIN106_B_0X1	(0x1u<<10)
#define	RIF_IISR3_ILACIN105_B_0X0	(0x0u<<9)
#define	RIF_IISR3_ILACIN105_B_0X1	(0x1u<<9)
#define	RIF_IISR3_ILACIN104_B_0X0	(0x0u<<8)
#define	RIF_IISR3_ILACIN104_B_0X1	(0x1u<<8)
#define	RIF_IISR3_ILACIN103_B_0X0	(0x0u<<7)
#define	RIF_IISR3_ILACIN103_B_0X1	(0x1u<<7)
#define	RIF_IISR3_ILACIN102_B_0X0	(0x0u<<6)
#define	RIF_IISR3_ILACIN102_B_0X1	(0x1u<<6)
#define	RIF_IISR3_ILACIN101_B_0X0	(0x0u<<5)
#define	RIF_IISR3_ILACIN101_B_0X1	(0x1u<<5)
#define	RIF_IISR3_ILACIN100_B_0X0	(0x0u<<4)
#define	RIF_IISR3_ILACIN100_B_0X1	(0x1u<<4)
#define	RIF_IISR3_ILACIN99_B_0X0	(0x0u<<3)
#define	RIF_IISR3_ILACIN99_B_0X1	(0x1u<<3)
#define	RIF_IISR3_ILACIN98_B_0X0	(0x0u<<2)
#define	RIF_IISR3_ILACIN98_B_0X1	(0x1u<<2)
#define	RIF_IISR3_ILACIN97_B_0X0	(0x0u<<1)
#define	RIF_IISR3_ILACIN97_B_0X1	(0x1u<<1)
#define	RIF_IISR3_ILACIN96_B_0X0	(0x0u<<0)
#define	RIF_IISR3_ILACIN96_B_0X1	(0x1u<<0)

// IISR4 Configuration

#define	RIF_IISR4_ILACIN159			(0x1u<<31)
#define	RIF_IISR4_ILACIN158			(0x1u<<30)
#define	RIF_IISR4_ILACIN157			(0x1u<<29)
#define	RIF_IISR4_ILACIN156			(0x1u<<28)
#define	RIF_IISR4_ILACIN155			(0x1u<<27)
#define	RIF_IISR4_ILACIN154			(0x1u<<26)
#define	RIF_IISR4_ILACIN153			(0x1u<<25)
#define	RIF_IISR4_ILACIN152			(0x1u<<24)
#define	RIF_IISR4_ILACIN151			(0x1u<<23)
#define	RIF_IISR4_ILACIN150			(0x1u<<22)
#define	RIF_IISR4_ILACIN149			(0x1u<<21)
#define	RIF_IISR4_ILACIN148			(0x1u<<20)
#define	RIF_IISR4_ILACIN147			(0x1u<<19)
#define	RIF_IISR4_ILACIN146			(0x1u<<18)
#define	RIF_IISR4_ILACIN145			(0x1u<<17)
#define	RIF_IISR4_ILACIN144			(0x1u<<16)
#define	RIF_IISR4_ILACIN143			(0x1u<<15)
#define	RIF_IISR4_ILACIN142			(0x1u<<14)
#define	RIF_IISR4_ILACIN141			(0x1u<<13)
#define	RIF_IISR4_ILACIN140			(0x1u<<12)
#define	RIF_IISR4_ILACIN139			(0x1u<<11)
#define	RIF_IISR4_ILACIN138			(0x1u<<10)
#define	RIF_IISR4_ILACIN137			(0x1u<<9)
#define	RIF_IISR4_ILACIN136			(0x1u<<8)
#define	RIF_IISR4_ILACIN135			(0x1u<<7)
#define	RIF_IISR4_ILACIN134			(0x1u<<6)
#define	RIF_IISR4_ILACIN133			(0x1u<<5)
#define	RIF_IISR4_ILACIN132			(0x1u<<4)
#define	RIF_IISR4_ILACIN131			(0x1u<<3)
#define	RIF_IISR4_ILACIN130			(0x1u<<2)
#define	RIF_IISR4_ILACIN129			(0x1u<<1)
#define	RIF_IISR4_ILACIN128			(0x1u<<0)

#define	RIF_IISR4_ILACIN159_B_0X0	(0x0u<<31)
#define	RIF_IISR4_ILACIN159_B_0X1	(0x1u<<31)
#define	RIF_IISR4_ILACIN158_B_0X0	(0x0u<<30)
#define	RIF_IISR4_ILACIN158_B_0X1	(0x1u<<30)
#define	RIF_IISR4_ILACIN157_B_0X0	(0x0u<<29)
#define	RIF_IISR4_ILACIN157_B_0X1	(0x1u<<29)
#define	RIF_IISR4_ILACIN156_B_0X0	(0x0u<<28)
#define	RIF_IISR4_ILACIN156_B_0X1	(0x1u<<28)
#define	RIF_IISR4_ILACIN155_B_0X0	(0x0u<<27)
#define	RIF_IISR4_ILACIN155_B_0X1	(0x1u<<27)
#define	RIF_IISR4_ILACIN154_B_0X0	(0x0u<<26)
#define	RIF_IISR4_ILACIN154_B_0X1	(0x1u<<26)
#define	RIF_IISR4_ILACIN153_B_0X0	(0x0u<<25)
#define	RIF_IISR4_ILACIN153_B_0X1	(0x1u<<25)
#define	RIF_IISR4_ILACIN152_B_0X0	(0x0u<<24)
#define	RIF_IISR4_ILACIN152_B_0X1	(0x1u<<24)
#define	RIF_IISR4_ILACIN151_B_0X0	(0x0u<<23)
#define	RIF_IISR4_ILACIN151_B_0X1	(0x1u<<23)
#define	RIF_IISR4_ILACIN150_B_0X0	(0x0u<<22)
#define	RIF_IISR4_ILACIN150_B_0X1	(0x1u<<22)
#define	RIF_IISR4_ILACIN149_B_0X0	(0x0u<<21)
#define	RIF_IISR4_ILACIN149_B_0X1	(0x1u<<21)
#define	RIF_IISR4_ILACIN148_B_0X0	(0x0u<<20)
#define	RIF_IISR4_ILACIN148_B_0X1	(0x1u<<20)
#define	RIF_IISR4_ILACIN147_B_0X0	(0x0u<<19)
#define	RIF_IISR4_ILACIN147_B_0X1	(0x1u<<19)
#define	RIF_IISR4_ILACIN146_B_0X0	(0x0u<<18)
#define	RIF_IISR4_ILACIN146_B_0X1	(0x1u<<18)
#define	RIF_IISR4_ILACIN145_B_0X0	(0x0u<<17)
#define	RIF_IISR4_ILACIN145_B_0X1	(0x1u<<17)
#define	RIF_IISR4_ILACIN144_B_0X0	(0x0u<<16)
#define	RIF_IISR4_ILACIN144_B_0X1	(0x1u<<16)
#define	RIF_IISR4_ILACIN143_B_0X0	(0x0u<<15)
#define	RIF_IISR4_ILACIN143_B_0X1	(0x1u<<15)
#define	RIF_IISR4_ILACIN142_B_0X0	(0x0u<<14)
#define	RIF_IISR4_ILACIN142_B_0X1	(0x1u<<14)
#define	RIF_IISR4_ILACIN141_B_0X0	(0x0u<<13)
#define	RIF_IISR4_ILACIN141_B_0X1	(0x1u<<13)
#define	RIF_IISR4_ILACIN140_B_0X0	(0x0u<<12)
#define	RIF_IISR4_ILACIN140_B_0X1	(0x1u<<12)
#define	RIF_IISR4_ILACIN139_B_0X0	(0x0u<<11)
#define	RIF_IISR4_ILACIN139_B_0X1	(0x1u<<11)
#define	RIF_IISR4_ILACIN138_B_0X0	(0x0u<<10)
#define	RIF_IISR4_ILACIN138_B_0X1	(0x1u<<10)
#define	RIF_IISR4_ILACIN137_B_0X0	(0x0u<<9)
#define	RIF_IISR4_ILACIN137_B_0X1	(0x1u<<9)
#define	RIF_IISR4_ILACIN136_B_0X0	(0x0u<<8)
#define	RIF_IISR4_ILACIN136_B_0X1	(0x1u<<8)
#define	RIF_IISR4_ILACIN135_B_0X0	(0x0u<<7)
#define	RIF_IISR4_ILACIN135_B_0X1	(0x1u<<7)
#define	RIF_IISR4_ILACIN134_B_0X0	(0x0u<<6)
#define	RIF_IISR4_ILACIN134_B_0X1	(0x1u<<6)
#define	RIF_IISR4_ILACIN133_B_0X0	(0x0u<<5)
#define	RIF_IISR4_ILACIN133_B_0X1	(0x1u<<5)
#define	RIF_IISR4_ILACIN132_B_0X0	(0x0u<<4)
#define	RIF_IISR4_ILACIN132_B_0X1	(0x1u<<4)
#define	RIF_IISR4_ILACIN131_B_0X0	(0x0u<<3)
#define	RIF_IISR4_ILACIN131_B_0X1	(0x1u<<3)
#define	RIF_IISR4_ILACIN130_B_0X0	(0x0u<<2)
#define	RIF_IISR4_ILACIN130_B_0X1	(0x1u<<2)
#define	RIF_IISR4_ILACIN129_B_0X0	(0x0u<<1)
#define	RIF_IISR4_ILACIN129_B_0X1	(0x1u<<1)
#define	RIF_IISR4_ILACIN128_B_0X0	(0x0u<<0)
#define	RIF_IISR4_ILACIN128_B_0X1	(0x1u<<0)

// IISR5 Configuration

#define	RIF_IISR5_ILACIN159			(0x1u<<31)
#define	RIF_IISR5_ILACIN158			(0x1u<<30)
#define	RIF_IISR5_ILACIN157			(0x1u<<29)
#define	RIF_IISR5_ILACIN156			(0x1u<<28)
#define	RIF_IISR5_ILACIN155			(0x1u<<27)
#define	RIF_IISR5_ILACIN154			(0x1u<<26)
#define	RIF_IISR5_ILACIN153			(0x1u<<25)
#define	RIF_IISR5_ILACIN152			(0x1u<<24)
#define	RIF_IISR5_ILACIN151			(0x1u<<23)
#define	RIF_IISR5_ILACIN150			(0x1u<<22)
#define	RIF_IISR5_ILACIN149			(0x1u<<21)
#define	RIF_IISR5_ILACIN148			(0x1u<<20)
#define	RIF_IISR5_ILACIN147			(0x1u<<19)
#define	RIF_IISR5_ILACIN146			(0x1u<<18)
#define	RIF_IISR5_ILACIN145			(0x1u<<17)
#define	RIF_IISR5_ILACIN144			(0x1u<<16)
#define	RIF_IISR5_ILACIN143			(0x1u<<15)
#define	RIF_IISR5_ILACIN142			(0x1u<<14)
#define	RIF_IISR5_ILACIN141			(0x1u<<13)
#define	RIF_IISR5_ILACIN140			(0x1u<<12)
#define	RIF_IISR5_ILACIN139			(0x1u<<11)
#define	RIF_IISR5_ILACIN138			(0x1u<<10)
#define	RIF_IISR5_ILACIN137			(0x1u<<9)
#define	RIF_IISR5_ILACIN136			(0x1u<<8)
#define	RIF_IISR5_ILACIN135			(0x1u<<7)
#define	RIF_IISR5_ILACIN134			(0x1u<<6)
#define	RIF_IISR5_ILACIN133			(0x1u<<5)
#define	RIF_IISR5_ILACIN132			(0x1u<<4)
#define	RIF_IISR5_ILACIN131			(0x1u<<3)
#define	RIF_IISR5_ILACIN130			(0x1u<<2)
#define	RIF_IISR5_ILACIN129			(0x1u<<1)
#define	RIF_IISR5_ILACIN128			(0x1u<<0)

