hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_rif.h
#define	RIF_IISR5_ILACIN159_B_0X0	(0x0u<<31)
#define	RIF_IISR5_ILACIN159_B_0X1	(0x1u<<31)
#define	RIF_IISR5_ILACIN158_B_0X0	(0x0u<<30)
#define	RIF_IISR5_ILACIN158_B_0X1	(0x1u<<30)
#define	RIF_IISR5_ILACIN157_B_0X0	(0x0u<<29)
#define	RIF_IISR5_ILACIN157_B_0X1	(0x1u<<29)
#define	RIF_IISR5_ILACIN156_B_0X0	(0x0u<<28)
#define	RIF_IISR5_ILACIN156_B_0X1	(0x1u<<28)
#define	RIF_IISR5_ILACIN155_B_0X0	(0x0u<<27)
#define	RIF_IISR5_ILACIN155_B_0X1	(0x1u<<27)
#define	RIF_IISR5_ILACIN154_B_0X0	(0x0u<<26)
#define	RIF_IISR5_ILACIN154_B_0X1	(0x1u<<26)
#define	RIF_IISR5_ILACIN153_B_0X0	(0x0u<<25)
#define	RIF_IISR5_ILACIN153_B_0X1	(0x1u<<25)
#define	RIF_IISR5_ILACIN152_B_0X0	(0x0u<<24)
#define	RIF_IISR5_ILACIN152_B_0X1	(0x1u<<24)
#define	RIF_IISR5_ILACIN151_B_0X0	(0x0u<<23)
#define	RIF_IISR5_ILACIN151_B_0X1	(0x1u<<23)
#define	RIF_IISR5_ILACIN150_B_0X0	(0x0u<<22)
#define	RIF_IISR5_ILACIN150_B_0X1	(0x1u<<22)
#define	RIF_IISR5_ILACIN149_B_0X0	(0x0u<<21)
#define	RIF_IISR5_ILACIN149_B_0X1	(0x1u<<21)
#define	RIF_IISR5_ILACIN148_B_0X0	(0x0u<<20)
#define	RIF_IISR5_ILACIN148_B_0X1	(0x1u<<20)
#define	RIF_IISR5_ILACIN147_B_0X0	(0x0u<<19)
#define	RIF_IISR5_ILACIN147_B_0X1	(0x1u<<19)
#define	RIF_IISR5_ILACIN146_B_0X0	(0x0u<<18)
#define	RIF_IISR5_ILACIN146_B_0X1	(0x1u<<18)
#define	RIF_IISR5_ILACIN145_B_0X0	(0x0u<<17)
#define	RIF_IISR5_ILACIN145_B_0X1	(0x1u<<17)
#define	RIF_IISR5_ILACIN144_B_0X0	(0x0u<<16)
#define	RIF_IISR5_ILACIN144_B_0X1	(0x1u<<16)
#define	RIF_IISR5_ILACIN143_B_0X0	(0x0u<<15)
#define	RIF_IISR5_ILACIN143_B_0X1	(0x1u<<15)
#define	RIF_IISR5_ILACIN142_B_0X0	(0x0u<<14)
#define	RIF_IISR5_ILACIN142_B_0X1	(0x1u<<14)
#define	RIF_IISR5_ILACIN141_B_0X0	(0x0u<<13)
#define	RIF_IISR5_ILACIN141_B_0X1	(0x1u<<13)
#define	RIF_IISR5_ILACIN140_B_0X0	(0x0u<<12)
#define	RIF_IISR5_ILACIN140_B_0X1	(0x1u<<12)
#define	RIF_IISR5_ILACIN139_B_0X0	(0x0u<<11)
#define	RIF_IISR5_ILACIN139_B_0X1	(0x1u<<11)
#define	RIF_IISR5_ILACIN138_B_0X0	(0x0u<<10)
#define	RIF_IISR5_ILACIN138_B_0X1	(0x1u<<10)
#define	RIF_IISR5_ILACIN137_B_0X0	(0x0u<<9)
#define	RIF_IISR5_ILACIN137_B_0X1	(0x1u<<9)
#define	RIF_IISR5_ILACIN136_B_0X0	(0x0u<<8)
#define	RIF_IISR5_ILACIN136_B_0X1	(0x1u<<8)
#define	RIF_IISR5_ILACIN135_B_0X0	(0x0u<<7)
#define	RIF_IISR5_ILACIN135_B_0X1	(0x1u<<7)
#define	RIF_IISR5_ILACIN134_B_0X0	(0x0u<<6)
#define	RIF_IISR5_ILACIN134_B_0X1	(0x1u<<6)
#define	RIF_IISR5_ILACIN133_B_0X0	(0x0u<<5)
#define	RIF_IISR5_ILACIN133_B_0X1	(0x1u<<5)
#define	RIF_IISR5_ILACIN132_B_0X0	(0x0u<<4)
#define	RIF_IISR5_ILACIN132_B_0X1	(0x1u<<4)
#define	RIF_IISR5_ILACIN131_B_0X0	(0x0u<<3)
#define	RIF_IISR5_ILACIN131_B_0X1	(0x1u<<3)
#define	RIF_IISR5_ILACIN130_B_0X0	(0x0u<<2)
#define	RIF_IISR5_ILACIN130_B_0X1	(0x1u<<2)
#define	RIF_IISR5_ILACIN129_B_0X0	(0x0u<<1)
#define	RIF_IISR5_ILACIN129_B_0X1	(0x1u<<1)
#define	RIF_IISR5_ILACIN128_B_0X0	(0x0u<<0)
#define	RIF_IISR5_ILACIN128_B_0X1	(0x1u<<0)
